{
    "reply": [
        {
            "reply_author": "mary19068", 
            "reply_time": "2019-04-02T20:37+00:00", 
            "reply_content": "Hi  heather32437 You may have a viral infection which    will not get rid of. You will either have to wait for it to go in it's own or see your doc for tests for viral infection and get anti viral medication...."
        }, 
        {
            "reply_author": "heather32437", 
            "reply_time": "2019-04-02T22:49+00:00", 
            "reply_content": "Already asked my doc about a virus. He's discounting that as a possibility because viruses wouldn't last for over two weeks without a   and additional symptoms."
        }, 
        {
            "reply_author": "Esther2016", 
            "reply_time": "2019-04-02T20:43+00:00", 
            "reply_content": "Heather: Time to get another Doctor.  Something is obviously wrong.  You might have a severe virus or infection.  Have you had vaccinations?  I would go to another doctor and find out what is really going on.  Because obviously, something is!  Please let us know how you make out and I hope you feel better soon."
        }, 
        {
            "reply_author": "heather32437", 
            "reply_time": "2019-04-02T22:55+00:00", 
            "reply_content": "Esther, I'm vaccinated for everything currently recommended for travelers in India by the World Health Organization (WHO). This illness probably isn't bacterial or viral, else the two weeks of treatment would have given me relief."
        }, 
        {
            "reply_author": "Esther2016", 
            "reply_time": "2019-04-03T00:02+00:00", 
            "reply_content": "Then get a stool test to find out if you are bleeding in your digestive tract.  I would recommend an upper and lower gi series.  That way, the Dr. will definitely know what is going on inside you!"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-04-02T21:35+00:00", 
            "reply_content": "Ask for a stool sample to be tested for infections like h pylori and try a food diary to see if a food is the cause.    Sometimes a change of diet can upset your stomach and cause  ."
        }, 
        {
            "reply_author": "heather32437", 
            "reply_time": "2019-04-02T22:46+00:00", 
            "reply_content": "Change of diet hasn't occurred. I've had the same diet and drinking water for years."
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-04-03T00:28+00:00", 
            "reply_content": "Maybe you have become intolerant to something in your diet that you weren't intolerant to before and are unaware of it.  A change of diet doesn't always cause problems.  You can suddenly develop reactions to foods that you were fine with in the past.  Still try a food diary to see if what you are eating at present is the cause.  For example,  I didn't have an intolerance to certain fatty foods when I was a child, but when I reached my late teens, I developed problems digesting certain fatty foods.   I still have this problem but not as bad as before.  Avoidance of these trigger foods stops my bad reactions. Try eliminating bread and other foods containing gluten.  You may have trouble with gluten which can manifest as non celiac gluten intolerance where you can eat a little gluten, or celiac disease which means you can't eat any gluten.  Symptoms of celiac can include   and  .  Ask for celiac blood test and or an endoscopy to identify it.  However, for these tests,  you need to be eating gluten containing foods for the test to be accurate.  Bread might be the culprit."
        }, 
        {
            "reply_author": "heather32437", 
            "reply_time": "2019-04-03T01:00+00:00", 
            "reply_content": "Did you experience diarrhea and vomitting after roughly 48 hours without eating? There have been three times in the past couple of weeks where I ate and drank absolutely nothing besides water and ORS for almost two days. This makes me certain that it's not food related."
        }
    ], 
    "post": "I've had severe(yellow) diarrhea, abdominal cramps, and vomiting for two weeks.\nI was prescribed Novaclav 625mg antibiotics, loperamide hydrochloride 2mg, and probiotics for three days. While taking this course, I felt somewhat better. But by day 4, I was very dehydrated and went to a local hospital.\nThey then gave me stat doses of IV DNS+MVL, Drotin IV, Emeset 4mg IV, and Pantop 40 IV. Following this, I was prescribed with 5 days of T. Ciplox TZ, T. Mehrogyl 200, C. Imodium, C Dorolac, and Oral Rehydration Salts.\nDuring this second round of meds, I felt somewhat better. However I'm still vomitting after eating/drinking more than tiny bits. I am also feeling stomach cramping  and having yellow diarrhea.\nI've talked to my doctor and the hospital staff and they are convinced that I am just having upset stomach due to the local food or water. I believe those are not the causes- i only drink purified bottled water (which I've drank for two years with no problem) and since being sick, I've only eaten plain, simple food like rice or toast without spices.\nWhat could be the cause of this?\nI traveled to Mumbai days before getting sick and live in Delhi, India. Since getting sick, I've only eaten simple foods like plain rice and bread. Water has all been double filtered. That means that the infection first happened 2 weeks ago in Mumbai and two rounds of antibiotics haven't gotten rid of this problem.", 
    "author": "heather32437", 
    "title": "Undiagnosed cause of diarrhea and abdominal cramps?"
}
{
    "reply": [
        {
            "reply_author": "jeff4242", 
            "reply_time": "2019-04-01T13:45+00:00", 
            "reply_content": "hi, what kind of food you mainly eat in a daily basis? do you eat 3x a day? what are the test you've had already?"
        }, 
        {
            "reply_author": "Esther2016", 
            "reply_time": "2019-04-01T21:26+00:00", 
            "reply_content": "I eat 6 times a day Jeff.  I eat chicken more than anything else.  Also, can have mott's unsweetened blueberry applesauce.  I have had multiple upper and lower gi's.  Lowers suck, I have started to bleed afterwards due to all the salt in the mag. citrate. I don't make the meals for the weekend.  I just eat whatever is leftover from making the meals for the work week.  Sometimes, I just eat 3 or 4 meals on the weekends.  I know I should eat, eat, eat, so that is what I am doing now."
        }, 
        {
            "reply_author": "jeff4242", 
            "reply_time": "2019-04-01T21:44+00:00", 
            "reply_content": "my diet is mainly chicken too. chicken or fish no fried stuff for me. I use to eat almost anything out there before. I lost a lot of weight since i adjusted my diet and it's been a year now. I don't go to the gym i walk a few times a week and my daily push ups and that's a about it. I was diagnosed of gallstones almost 2yrs ago that's why i cut out a lot from my diet. i get indigestion kind of pain upper abdomen and i don't know if that is from my gallstones. I myself trying my best to gain some weight back.."
        }, 
        {
            "reply_author": "Esther2016", 
            "reply_time": "2019-04-01T23:56+00:00", 
            "reply_content": "As the old saying goes \"Aint no fat people in the   Ward\" comes to mind. Jeff.  Do you also suffer from  ?  or is it just the gallstones?"
        }, 
        {
            "reply_author": "mary19068", 
            "reply_time": "2019-04-01T14:10+00:00", 
            "reply_content": "Hi Esther 2016 If fibre is all you eat then i suggest you start to eat other foods. A hi fibre diet would make you prone to using your bowels frequently possibly losing nutrition. Start eating a variety of fruit, veg, chicken, fish the occasional pudding or dessert.. Try eating gluten free.. There are a variety of gluten free and wheat foods in popular supermarkets. ...."
        }, 
        {
            "reply_author": "Esther2016", 
            "reply_time": "2019-04-01T21:22+00:00", 
            "reply_content": "Thank you Mary.  I am sick of eating fiber, fiber, fiber.  It fills you up and then you don't want to eat again for hours afterwards.  Fruit for me is bananas, apples and canned skinless peaches or bartlett pears.  That is it.  I am finding certain gluten makes me sick too.  I eat canned, no salt, sardines in water, 5 days a week.  I eat hard boiled eggs in the morning, with a banana and another banana at work.  I spend one day on the weekend (the better part of the day) making all my meals for the week.  I so hate cooking now for this very reason 😦. When I cheat, I eat vanilla pizzelles.  I love them and usually can't stop at 2.  Sometimes I make my own salt free crackers.  I am going to buy a vitamix soon so that I can make my own nut butter. I want you all to know how grateful I am for your input.  You, Mary, Pippa, and Jason, Jeff.  I feel so much better talking to people in the same boat as myself.   People who know exactly what I am talking about."
        }, 
        {
            "reply_author": "mary19068", 
            "reply_time": "2019-04-01T22:20+00:00", 
            "reply_content": "Hi Esther2016 Just happy to help..try a different healthy food regime and see how you get on.....keep us posted..."
        }, 
        {
            "reply_author": "Esther2016", 
            "reply_time": "2019-04-01T23:50+00:00", 
            "reply_content": "I will Mary and Many Thanks in Advance to all who responded.  I have yet another question for the group LOL. Do any of you take probiotics?  If so, which brand(s) do you use?  How many billions of cfu's do you take?"
        }, 
        {
            "reply_author": "mary19068", 
            "reply_time": "2019-04-02T09:18+00:00", 
            "reply_content": "Hi Esther2016 Yes i take probiotics. Pic attached. I find these very good they have added fibre...."
        }, 
        {
            "reply_author": "Esther2016", 
            "reply_time": "2019-04-02T13:42+00:00", 
            "reply_content": "Thanks Mary!"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-04-01T14:27+00:00", 
            "reply_content": "Speak to a dietician about your weight and see if you can get any advice there.  Try not to stress about your health because   can cause weight loss.   Try distraction techniques to help to take your mind off your symptoms.  Light exercise such as walking and doing things you enjoy can help."
        }, 
        {
            "reply_author": "Esther2016", 
            "reply_time": "2019-04-01T21:13+00:00", 
            "reply_content": "Many Thanks for your response pippa!  I saw a dietician when I was first diagnosed.  She said I could have 1/4 cup blueberries.  I was afraid and should have listened to my inner voice.  I was violently sick for 3 days after that.  I can actually have 6 blueberries with the steel cut oats in the morning now.  You are right about the  , I have had more of that than anything else and am trying to learn new ways to calm down.  Many thanks for your input.  It is truly appreciated!"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-04-01T22:22+00:00", 
            "reply_content": "Hope you feel better soon."
        }, 
        {
            "reply_author": "Esther2016", 
            "reply_time": "2019-04-01T23:59+00:00", 
            "reply_content": "Thanks pippa!  Do you also suffer from  ?"
        }, 
        {
            "reply_author": "Esther2016", 
            "reply_time": "2019-04-02T00:15+00:00", 
            "reply_content": "Thanks Pippa.  I wonder what you are all suffering from too.  I hope that I will be able to offer some advice in return!"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-04-02T00:26+00:00", 
            "reply_content": "No, I have IBS and GERD.   The IBS is in remission and I control my reflux with milk and  .   My   caused both these conditions but I find that if I avoid stress and do things I enjoy, that helps me a lot."
        }, 
        {
            "reply_author": "Esther2016", 
            "reply_time": "2019-04-02T13:19+00:00", 
            "reply_content": "I didn't realize how much my   would make my medical issues much worse.  But I am starting to find that out."
        }, 
        {
            "reply_author": "Esther2016", 
            "reply_time": "2019-04-02T13:46+00:00", 
            "reply_content": "The IBS is in remission. I didn't think it was like  ?  Or has it just calmed down a bit?"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-04-02T14:13+00:00", 
            "reply_content": "IBS never really goes away but it can go away for while.  That's what I mean by remission.  Thank goodness it's not like  !"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-04-02T14:14+00:00", 
            "reply_content": "The gut brain axis is very strong and this why   makes gut conditions worse."
        }, 
        {
            "reply_author": "Esther2016", 
            "reply_time": "2019-04-02T16:40+00:00", 
            "reply_content": "I am just learning that my gut has a brain.  In fact, I learned that yesterday, while researching. On  a better note, I think I gained a lb.  YAY!"
        }, 
        {
            "reply_author": "Esther2016", 
            "reply_time": "2019-04-02T17:13+00:00", 
            "reply_content": "My   will never go away either.  I am very happy that you don't have   Pippa. I do have an odd question.  Is there any way you can see all the posts you have made on this site?  I can't seem to find out how to do this or even if I can do this?"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-04-03T00:31+00:00", 
            "reply_content": "You could go into your own page where it will list all the posts you have made."
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-04-03T00:39+00:00", 
            "reply_content": "I wouldn't worry about your weight because it may be you have a fast metabolism.  I have a fast metabolism and stay at the same weight but I don't worry about it.   Forget about your weight and concentrate on things you enjoy.   My doctor tells me that I am underweight but I don't listen to this because my mum was also very slim when she was young.  It is a family trait on her side.  My brother is the same and my dad was also very slim when he was younger."
        }
    ], 
    "post": "Please help me gain weight.  I have been on a bland, high fiber diet for the last 3 years.  I had \n episode a few weeks ago lost 5 lbs. and can't gain weight.  Doesn't matter whether I cheat or not.  Just not gaining.  Really need some tips.  Dr. says that if I fall below 150lbs.  I will be in trouble.  Feel like I am already there.  I have gastritis and gerd.", 
    "author": "Esther2016", 
    "title": "Gastritis, can't gain weight"
}
{
    "reply": [
        {
            "reply_author": "Ezekiel", 
            "reply_time": "2017-12-01T05:57+00:00", 
            "reply_content": "Doctor's diagnose IBS all the time when they can't figure it out. Maybe it's not their fault when none of the tests show anything. I was extremely ill for months and all tests were normal. Nausea, heartburn, no appetite, major weight loss. Then one day all my symtoms cleared up and I expelled what was a large round white  sinking what I think from my own research was a gallstone. I wish now that I had saved it to have it analyzed. I never went back to doctor as I felt fine after that. I had always thought that gallstones were small and brown but have since discovered they can be like size of a golf ball and white and other colors. Pretty sure my bile duct was blocked by this and causing all my symtoms."
        }, 
        {
            "reply_author": "lilian05079", 
            "reply_time": "2017-12-01T09:55+00:00", 
            "reply_content": "Hi  .55 Yes that's right you can get large calcium stones in the gallbladder which are white..I know this because i've got one but it gives me no bother...and they can break up into smaller versions and be passed out through the system in the normal way..i'm pleased that you have no more problem..my best wishes..."
        }, 
        {
            "reply_author": "val40792", 
            "reply_time": "2017-12-01T09:33+00:00", 
            "reply_content": ""
        }, 
        {
            "reply_author": "lilian05079", 
            "reply_time": "2017-12-01T09:52+00:00", 
            "reply_content": "Hi Vanessalee Regarding the forum there are members who can contribute with their knowledge and experience and certainly can help as perhaps they have experienced the same symptoms and have got a diagnosis and are now well. The reason for the forum is for people to join and try and be if some help and comfort to other members. I am sure other members will be along with their kind help and good advice. Vanessalee, i know you can't pinpoint food as the cause, but have you kept a food diary to see if there are any food triggers. Also, the cause may be pancreatic as the pancreas cannot always be seen on a scan as it sits behind the stomach. Try the food diary.  If his diet consists of spicey or fried foods or anything that can irritate the gut such as fizzy drinks and citrus fruits leave them out of the diet and just use bland recipes like chicken, fish veggies but a little of sprouts, cabbage, broc as too much can cause gas. Plenty of water. Try these changes and see if there is any change...i know a lot of people have kept diaries and made food changes with good redults..my very best wishes to you and your dear husband Vanessalee.."
        }, 
        {
            "reply_author": "holly65159", 
            "reply_time": "2017-12-01T10:44+00:00", 
            "reply_content": "I have IBS but never had any of those symptoms other than the diarrhea.   Has he seen a Gastroenterologist?  If not, that would be what I would recommend.  It could be stress related because that can create all kinds of havoc to your system.  There are to many things that it could be related to.  Gastroenterology and a counselor/psychiatrist may be the best start.  Talk to the doctor if needed to get some referrals.  He may just need meds for  .  Anyways, I am not a doctor but having my own stomach issues, I like any suggestions I can get even if I have tried them before.  Good luck to your husband!!! HG P.S. If he has an issue with going to see a counselor/psychiatrist let him know that it is a better alternative than suffering.  They are there to help.  That is there main mission in life.                       "
        }, 
        {
            "reply_author": "Vanessalee", 
            "reply_time": "2017-12-01T18:50+00:00", 
            "reply_content": "He did see a counselor and still is but I don't believe it is helping. It's nice though but not going to solve it I'm fairly certain and he did just get a new prescription to try, it's Zoloft which I think is for both IBS and anxiety. It is for sure aggravated by stress but if it was just that or anxiety I would expect it would have subsided more by now since he's been off work over 10 weeks. I sure hope the Zoloft works.Thanks again for your responses. "
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2017-12-02T01:25+00:00", 
            "reply_content": ""
        }, 
        {
            "reply_author": "Vanessalee", 
            "reply_time": "2017-12-01T13:06+00:00", 
            "reply_content": ""
        }, 
        {
            "reply_author": "holly65159", 
            "reply_time": "2017-12-01T17:38+00:00", 
            "reply_content": ""
        }, 
        {
            "reply_author": "Vanessalee", 
            "reply_time": "2017-12-01T18:46+00:00", 
            "reply_content": "Thank you I am going to look into this Fodmap diet.  We've asked to be referred to a specialist and his doctor would not and we would like to try another family doctor however we are in Canada and to switch is a 2 yr wait. There are no doctors taking new patients right now. I think I may call around though to the gastro's and basically beg for one of them to see him without the referral. I just have a feeling it's not IBS but can't really argue with the doctor as they really have tested and looked into many things and everything looks good. I know things can definitely be missed though!"
        }, 
        {
            "reply_author": "holly65159", 
            "reply_time": "2017-12-01T22:01+00:00", 
            "reply_content": "That is tough!! I would beg to see another doctor.  I would try the fodmap which is a good start and even though all the tests came back ok that doesn't mean much.  All mine did too!! But I do know mine is IBS your husbands doesn't especially with the back pain.  Hopefully, you will get some answers soon!! "
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2017-12-02T00:55+00:00", 
            "reply_content": ""
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2017-12-01T13:11+00:00", 
            "reply_content": "Does his pain move about his stomach?   Maybe try the Low Fodmap diet or a food diary to see if there is a food trigger. Ask for an antispasmodic like Buscopan. IBS can be felt on the left side because that's where the intestines are located.  Frequent   or   or a mixture of both is also a sign of IBS. Stress can cause IBS and makes existing IBS worse. I have stress related IBS and started off with constant, daily, generalised stomach pain that moved about and caused four different types of pain: dull, deep seated, stabbing and sore to touch.  I had constipation and back pain which changed to loose, urgent stools.  This went on for three and a half months. I had an ultrasound, stool tests, a urine test, and a celiac test which showed nothing.  On my eighth visit to my doctor, I was diagnosed with IBS. My health anxiety disappeared and my IBS much improved. When all your tests are negative, IBS can be diagnosed.  IBS s functional and doesn't show on any scan.   You could ask for a SECHAT scan to check for Bile acid malabsorption which causes diarrhoea.  Sometimes this condition is misdisgnosed as IBS D.  However, I would try monitoring your diet,  controlling stress levels and an antispasmodic first.  You may have to try several. If these things help, it is likely to be IBS.  However, sometimes IBS does not respond to any treatment. In short, his symptoms sound very like IBS."
        }, 
        {
            "reply_author": "leanne2402", 
            "reply_time": "2017-12-01T13:53+00:00", 
            "reply_content": "Hi, your husbands symptoms sound just like mine, but minus the diarrhea. I've had it for 4 months now, all my tests - several bloods, urine, stool, ultra sound,   and endoscopy have shown nothing. I saw my dr yesterday and he has said there's nothing else he can do so ive now got to live with it. My dr is convinced it's not ibs,  and I don't think it is either. I don't have ibs symptoms. I've kept a food diary for months, there's no food triggers either. I'm a semifit 34 year old female,  never been ill or had any serious conditions.  I hope you both get an answer and if so let me know as I might but that one to my dr.   X"
        }, 
        {
            "reply_author": "Vanessalee", 
            "reply_time": "2017-12-01T15:05+00:00", 
            "reply_content": "When his symptoms started he would have been right around 33 or 34 as well and also semifit. I don't think it's food related because he has tried about 40 combined weeks of extremely strict cleanses eliminating absolutely everything that could be considered even remotely unhealthy so unless it's something like a fruit or veg causing it it's not that.  For my husband the diarrhoeah only started really in the last year. Maybe he has IBS as well now or this has turned into IBS but his main symptom, the gnawing pain that is always there and feels better often after food I just don't think it is IBS. We are basically at the same spot as you, doctor doesn't really have anything else to do just prescribing meds for IBS now that haven't worked so far. To me it really sounds like something related to the pancreas however his MRI showed it was good. If you do happen to figure out what yours is please if you think about it come back here and let me know because we're desperate and I'll try to do the same. Good luck to you. "
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2017-12-02T01:47+00:00", 
            "reply_content": ""
        }, 
        {
            "reply_author": "holly65159", 
            "reply_time": "2017-12-02T12:32+00:00", 
            "reply_content": "Did they check his kidney's because it is possible it could be  ?  Although, I have a friend that has kidney stones and he notices that he is uncomfortable when he goes to the bathroom.  But he always has severe back pain.  I was looking for answers for you under WebMd but there are so many different things it can be related to.  If he starts feeling better after eating, it doesn't sound like it could be IBS.  From what I know for myself and from several others that have IBS, most foods cause discomfort.  You would be surprised the things on the list (if you have not already looked it up) that you shouldn't eat.  They are: dairy, wheat, chocolate, soft cheeses, several different vegetables and fruits, HFCS and no artificial sweeteners.  Those are the most common things that most people eat everyday.  Gluten free for pastas etc are better for you.  I think that has what has made a difference as well as some of the vegetables and fruit   Maybe just trying to avoid some of those things might be worth a try.  Keep trying!!!  "
        }, 
        {
            "reply_author": "Vanessalee", 
            "reply_time": "2018-09-02T17:07+00:00", 
            "reply_content": "Has had several scopes and no ulcers. It still is happening but worse. He was diagnosed with sibo after a positive breath test and treated with 3 round of  . The D got better but that's it, the constant knotted, gnawing feeling in his stomach is still there constantly. He also has.been diagnosed with hypothyroidism but it's not that either. I just know there is something else happening that is causing all these other things. The search continues... "
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2018-09-03T17:41+00:00", 
            "reply_content": ""
        }
    ], 
    "post": "Hi all I need some help. My husband's doctor diagnosed him with IBS and I just don't buy it. Tell me does this sound like IBS to you?\nHe has a near constant pain on his left side below his ribs. Sometimes when it's at its worst it radiates into his back. It is often worst when he first wakes up in the morning and eating usually makes to feel better. He describes the feeling sometime as being similar to feeling exremely hungry or like knots in his stomach (like being anxious) even when there is nothing anxious on his mind. It is worse when he is tired or stressed but can be sitting down having a a great relaxing time thinking of nothing to do with this pain and it starts up. Ultrasounds were clear.  He's had endoscopy, colonsocopy,  MRI and bloods were all good. He does have diahreoah often. There Is no difference with foods that we can find. We are desperate and grasping at straws so any ideas are very welcome.  Also he has been off work for 10 weeks because of this because his job is strssful and it is not better. Thanks everyone. ", 
    "author": "Vanessalee", 
    "title": "IBS or just BS? IBS sufferers is this what It feels like?"
}
{
    "reply": [
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-28T19:02+00:00", 
            "reply_content": "Maybe the start of a haemorrhoid?  Ask your doctor to examine you."
        }, 
        {
            "reply_author": "asadur10294", 
            "reply_time": "2019-03-28T19:13+00:00", 
            "reply_content": "Some time ago a friend of mine had this kind of problem, Thank you, as soon as possible"
        }, 
        {
            "reply_author": "chandler02182", 
            "reply_time": "2019-03-28T19:31+00:00", 
            "reply_content": "what was it and was it cured ?"
        }, 
        {
            "reply_author": "asadur10294", 
            "reply_time": "2019-04-02T03:05+00:00", 
            "reply_content": "Tumor was under the neck and it was resolved by the operation, my friend is healthy now"
        }
    ], 
    "post": "symptoms: \nstraining and ass stretches  a bit outward while pooping\nno pain\nmaybe a painless lump like thing around anus wall.\n (gross warning)", 
    "author": "chandler02182", 
    "title": "Is it internal rectum prolapse ?"
}
{
    "reply": [
        {
            "reply_author": "moon53540", 
            "reply_time": "2019-03-31T19:49+00:00", 
            "reply_content": "When you say under your ribs do you mean behind or beneath? Which side or is it both sides? Where in your stomach does it hurt mainly?"
        }, 
        {
            "reply_author": "n55686", 
            "reply_time": "2019-03-31T22:34+00:00", 
            "reply_content": "beneath  most commonly towards the right...but most of the time right in the middle Just below breastbone"
        }, 
        {
            "reply_author": "moon53540", 
            "reply_time": "2019-03-31T23:22+00:00", 
            "reply_content": "I was thinking maybe  ,  possibly gallstones as the pain goes to the right, maybe pancreatitis. Have you been tested for h pylori? There are a few things this could be, so ask if you can have an endoscopy and if they haven't already given you one, an h pylori test? Then if that is clear ask for an ultrasound or MRI. Don't take any   like ibuprofen or aspirin as it can upset your stomach more."
        }, 
        {
            "reply_author": "Joannwilson", 
            "reply_time": "2019-03-31T19:53+00:00", 
            "reply_content": "well one thing they always tell me is to eliminate diet. Which is really eat one thing at a time until what makes you sick. So you would not eat for at least 24 hours and let your body eliminate whatever you have eaten. Then you eat 1 item and see the results if it makes you have the symptoms then you know you can not eat that item. Say you eat an apple and it makes you burp or get gas or reflux then you know it was the apple. That is the simple explanation. I call it elimination because you are figuring out what causes the same results."
        }, 
        {
            "reply_author": "Joannwilson", 
            "reply_time": "2019-03-31T19:53+00:00", 
            "reply_content": "well one thing they always tell me is to eliminate diet. Which is really eat one thing at a time until what makes you sick. So you would not eat for at least 24 hours and let your body eliminate whatever you have eaten. Then you eat 1 item and see the results if it makes you have the symptoms then you know you can not eat that item. Say you eat an apple and it makes you burp or get gas or reflux then you know it was the apple. That is the simple explanation. I call it elimination because you are figuring out what causes the same results."
        }, 
        {
            "reply_author": "Krista35738", 
            "reply_time": "2019-03-31T20:19+00:00", 
            "reply_content": "I've been burping ceaselessly from June 2017. Visited my doctor in July, prescribed Omeprazole. It worked, honestly.  The burping returned when I began exercising. I started Omeprazole again, I hope it works too. Keep you posted. Don't let it consume your mind. It makes everything seem worse."
        }, 
        {
            "reply_author": "n55686", 
            "reply_time": "2019-03-31T22:36+00:00", 
            "reply_content": "thanks 😃 doc had put me on Omep for a month and made some difference ...yes please do!"
        }, 
        {
            "reply_author": "mary19068", 
            "reply_time": "2019-03-31T20:30+00:00", 
            "reply_content": "Hi n55686 I agree with joannewilson do an elimination diet and find out the food  triggers which may be causing your problem. I also agree with krista35738 stop stressing!!...there is nothing worse to  cause or aggravate digestion problems than   and stressing about it..."
        }, 
        {
            "reply_author": "Joannwilson", 
            "reply_time": "2019-03-31T21:25+00:00", 
            "reply_content": "yes stress is a killer. I got worse from stress than anything else. I started to get free subliminal music that was for relaxation. Since I enjoy the sound of rain thats the one I use. I use the subliminal ones because I know my brain would pick up anything like an accent or any kind of distracting thing. So instead of being able to concentrate on the idea I would be listening for something else. I had to figure out what relaxed me before I could get my mind off my problems and if you think about it thats what it takes. They do have regular kind that just play a sound like an old steam train, or crickets. Try a few and see which makes you feel relaxed or which makes you feel more tense. then you can use them to filter out outside sounds and noise any time you need it. I am a country girl living in the city and all the noise gets me riled up so if I play a recording of rain I relax. A lot of stress we don't even realize its building up but our body knows & signals us to take action somehow. If we don't listen, like a car without maintenance it will  break down sooner or later. a car will completely seize up and you can't drive it no matter how much you want to. You could push it or pull it but its not using its own power because it can't. Hope this helps, I just know what happened to me & how I had to do something or end up worse."
        }, 
        {
            "reply_author": "mary19068", 
            "reply_time": "2019-03-31T22:02+00:00", 
            "reply_content": "Hi joannewilson Sounds good to me👍 I'l keep those relaxation tips in mind...😊🤗"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-04-01T00:23+00:00", 
            "reply_content": "Do you have trouble with bowel movements?  Shifting  ,  bowel habit change and gas are IBS symptoms.    Have you tried a food diary to see if any foods are causing pain and burping  There seems to be a connection since you burp after eating or drinking.  People with IBS often find that when they are busy, their symptoms subside because they are not concentrating on them.  Stress can make gut problems worse and can also cause them.  Have you had any recent stress?    Try a stress diary to see if your symptoms appear or get worse with anxiety. I would ask your doctor about IBS, have a stool sample tested for h pylori and ask about gastritis.   An ultrasound may also be useful to examine your abdominal organs to rule out anything there."
        }, 
        {
            "reply_author": "Joannwilson", 
            "reply_time": "2019-04-01T00:58+00:00", 
            "reply_content": "Advice to anyone is to try whatever works for you individually, rather than what might have worked for someone else. You know what kind of lifestyle you live and what you can tolerate. I know people that never had a single symptom then boom! Out of seemingly nowhere they got sick almost overnight. If something makes you so uncomfortable you start looking for answers or remedies then it is a problem. It might seem minor but what is just annoying to one person could be a catastrophe to another. It is very easy to say do this, it worked for me; you could have a serious problem and it could take time to ferret it out. My child always passed every test but always joked I Have to make A plus even for the doctor. That did not mean there was nothing physically wrong, it just took time to find out what it was."
        }, 
        {
            "reply_author": "Joannwilson", 
            "reply_time": "2019-04-01T00:58+00:00", 
            "reply_content": "Advice to anyone is to try whatever works for you individually, rather than what might have worked for someone else. You know what kind of lifestyle you live and what you can tolerate. I know people that never had a single symptom then boom! Out of seemingly nowhere they got sick almost overnight. If something makes you so uncomfortable you start looking for answers or remedies then it is a problem. It might seem minor but what is just annoying to one person could be a catastrophe to another. It is very easy to say do this, it worked for me; you could have a serious problem and it could take time to ferret it out. My child always passed every test but always joked I Have to make A plus even for the doctor. That did not mean there was nothing physically wrong, it just took time to find out what it was."
        }, 
        {
            "reply_author": "Joannwilson", 
            "reply_time": "2019-04-01T01:00+00:00", 
            "reply_content": "do not intend every post to be twice. I do not know why its doing that. SORRY"
        }, 
        {
            "reply_author": "Joannwilson", 
            "reply_time": "2019-04-01T01:00+00:00", 
            "reply_content": "do not intend every post to be twice. I do not know why its doing that. SORRY"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-04-01T11:23+00:00", 
            "reply_content": "Sometimes  it appears that your post hasn't sent when it actually has so you send it again but it duplicates.  It happens to me too at times."
        }
    ], 
    "post": "hi\nim a male in 30s  healthy diet not overweight do not drink.etc\nfor the past three months i have been experiencing on and off pain around my stomach and under my ribs - changes and moves around and not particulalry brought on by anything. It is not constant, and there can be hours particularly if im busy where i dont really notice anything.\ni have also been burping - this happens after i eat or drink anything, ill burp. Also when i stand.up or sit down or change position, ill burp a couple of times.\ni have been to my doctor in late jan, who get me a course of PPI...they worked a little  but nothing earth shattering and no other medication seems to control it. They did \n and everything was fine so with the limited progress i was making on the PPI I was told to \"put it to the back of my mind\".  Tried removing coffee but no real impact and same with milk.\nSo not sure what to do....im not going to lie it is occupying my mind a lot and not sure if i have brought this on myself via \n. It is tthe first thing i think about in the morning 😦\nany insights and reassurance  please 😃", 
    "author": "n55686", 
    "title": "Burping and uncomfy stomach for 3 months"
}
{
    "reply": [
        {
            "reply_author": "moon53540", 
            "reply_time": "2019-03-30T07:08+00:00", 
            "reply_content": "You could try some antacid tablets or liquid. If that doesn't work try ranitadine. Try and avoid fatty foods and too much alcohol. If you are having trouble digesting food, it might not be a bad idea to get some vitamin tests to see if you are deficient. B12 would be an important one to check."
        }, 
        {
            "reply_author": "barb49619", 
            "reply_time": "2019-04-01T15:09+00:00", 
            "reply_content": "yes yes at ranitidine works wonders you can get the generic it is really called zantac I take it at bedtime helps get rid of a lot of acid I also take prevacid in the morning and prevacid before supper but this helps me at bedtime so it doesn't come up it's called GERD"
        }, 
        {
            "reply_author": "joseph98786", 
            "reply_time": "2019-03-30T10:01+00:00", 
            "reply_content": "ask your doctor to send you for endescopy as it sounds like your lpr is not working properly."
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-30T12:32+00:00", 
            "reply_content": "My lower oesophageal sphincter doesn't work properly either."
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-30T12:30+00:00", 
            "reply_content": "I sometimes regurgitate food and I also get a lot of acid reflux.  I find OTC   or milk really help me.  Eczema tends to come and go in bouts  It can be connected to stress or a food trigger.  Try a food diary to identify a problem food and note down if there are any foods that are not digesting well.  Have you had any recent stress?  this can also upset the gut and cause reflux.  My reflux began after exam stress."
        }, 
        {
            "reply_author": "Corvette007", 
            "reply_time": "2019-03-30T17:56+00:00", 
            "reply_content": "Seeing a doctor can help prevent more serious conditions. You are absolutely right, unless you have some baby chicks to feed. You should NOT be having those problems. Another test we forget alot about but important is an esophagram. It is a barium drink and then you get behind an x-ray to see where it goes..or not. Or maybe you are about to become a momma bird soon...crosses fingers for ya. Start tracking your weight loss if it begins."
        }
    ], 
    "post": "I have a bad habit - started about 4 months ago - of burping up food I've eaten. Google calls this \"regurgitation.\" I remember the moment it first started - I was doing a push-up at the gym and I almost damaged the workout pad I was using when a little bit came out of my mouth. So that tells me that what was coming up was fairly acidic.\nFast forward to tonight - after eating too much oily beef broth for lunch, I'm finding myself nauseous, and burping up food to try to relieve the sensation. And I'm noticing something odd. What's coming up out of my stomach is not just beef broth, but also the walnuts I had for breakfast, and everything tastes exactly the same as it did when it went down. It's neither sour nor bitter, but salty and oily, with bits of walnut.\nThis tells me that the walnuts I ate 12 hours ago are still in my stomach, completely undigested.\nI'm like a bird momma, except I don't have anyone to feed except myself.\nDoes anyone have any light to shed on this? What's going on with my stomach? Should I see a professional?\nAside from all the burping, which is quite gross to anyone but me I'm sure, the only \"symptoms\" I could name are the re-appearance of eczema on both my hands and extremely dry skin. Some would interpret that as a deficiency of some sort. Otherwise, my sleep is good, appetite is present, can't complain about bowel movements.", 
    "author": "vanessa03649", 
    "title": "Regurgitating undigested food - what's happening with my stomach?"
}
{
    "reply": [
        {
            "reply_author": "nancy1942", 
            "reply_time": "2019-03-15T12:10+00:00", 
            "reply_content": "so sorry to hear what is happening to you.   my only suggestion is a probiotic.  i am a huge believer in them.   take the brand name FLORA 50 billion critical care, one a day.   see if this helps.  it gets rid of the bad bacteria in your stomach.  it may take a bit.  it took me about 2 weeks to notice a difference.    is good for  you any way.   hope it helps...."
        }, 
        {
            "reply_author": "ashton007", 
            "reply_time": "2019-03-17T01:23+00:00", 
            "reply_content": "ive tried probiotics in the past but they never seemed to do anything for me. I'll probably get another one and give it a second go around. thanks so much for your suggestions!"
        }, 
        {
            "reply_author": "kunal13963", 
            "reply_time": "2019-03-15T12:13+00:00", 
            "reply_content": "I suffered with constant nausea last year from 2018 march until July it was just not stopping but my symptoms were different I suffered from constant bloating I lost 11kg in one month. I  did the upper GI endoscopy on August result came as Antral   and a little erosion too and that was the cause of nausea,. my nausea was so damn bad I was scared of eating because I can't stand after I ate but now am fine though spicy and fast foods trigger the symptoms even today"
        }, 
        {
            "reply_author": "ashton007", 
            "reply_time": "2019-03-17T01:26+00:00", 
            "reply_content": "I'm glad you got it figured out!! I had an upper endoscopy recently which only showed some minor acid damage which the dr seemed to think was the cause of my nausea. However it was so minor i had a hard time accepting that, that was actually the main problem... and i didnt have any explanation for why i had acid damage in the first place. i took an acid reducer for 2 weeks to no avail..."
        }, 
        {
            "reply_author": "lester90053", 
            "reply_time": "2019-03-15T14:24+00:00", 
            "reply_content": "Has anyone ever checked to see if any of your meds are interacting with each other?"
        }, 
        {
            "reply_author": "ashton007", 
            "reply_time": "2019-03-17T01:26+00:00", 
            "reply_content": "the only medication im on is birth control."
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-17T02:15+00:00", 
            "reply_content": "Birth control medications could also be contributing to your symptoms.   Perhaps come off it to see if your symptoms improve."
        }, 
        {
            "reply_author": "ted43022", 
            "reply_time": "2019-03-15T17:26+00:00", 
            "reply_content": "I had that problem for a little over a year with being sick on my stomach and throwing up daily  they did an ultrasound and said all was good but then with all of the same symptoms I started hurting in my navel ti the point I didn't even want my shirt touching it at times but I couldn't see anything wrong with it but to make a long story short I went to see the decor I believe a check up and ask me if I was having any problems and I told him about my navel and he said that I had a navel   and it need to be fixed now. anyway he found out that I had been getting sick for over a year and said that before he fixes my hernia he wants to check my gallbladder  and I told him that I had it checked by ultrasound and he replied that that test is not reliable so he sent me for a different test right then and called me that day and let me know that my gallbladder was bad and that's was what was causing my being nauseous and throwing up and the throwing up is what caused my hernia. Hope it works out for u very soon. Also the stress and worry of it all and wondering what it is causes other problems or symptoms."
        }, 
        {
            "reply_author": "ashton007", 
            "reply_time": "2019-03-17T01:29+00:00", 
            "reply_content": "my goodness im sorry to hear you had such a struggle! ive had my gallbladder checked in the past but not with a HIDA scan like another person on here suggested. ive never heard of it so ill have to look into it. im glad you were able to figure out what was going on!"
        }, 
        {
            "reply_author": "mary19068", 
            "reply_time": "2019-03-15T21:00+00:00", 
            "reply_content": "Hi Ashton007 So sorry to hear about all your suffering i can well understand how it impacts on your life. Have you been tested for stomach candida which can cause severe nausea. It's a fungal type infection which can overtime get worse if it is not eradicated. As already mentioned by another forum member Probiotics will help to put good bacteria into your gut and create a good gut flora.  Also, did you have   for parasites?....."
        }, 
        {
            "reply_author": "ashton007", 
            "reply_time": "2019-03-17T01:31+00:00", 
            "reply_content": "i was actually just talking to my sister in law about this last night. i have very limited knowledge about candida but so far it seems to meet most of my symptoms! which is exciting yet also dissappinting and scary. i havent been tested for parasites yet, and someone also suggested limes disease. im learning how many different things my symptoms are pointing to..."
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-16T13:17+00:00", 
            "reply_content": "Has h pylori and   been mentioned?   Have you had a HIDA scan to check gallbladder function? An ultrasound only shows up stones and sludge.    Have you had stool tests?"
        }, 
        {
            "reply_author": "ashton007", 
            "reply_time": "2019-03-17T01:33+00:00", 
            "reply_content": "ive never heard of that kind of gallbladder scan before! im excited to look into it. my insurance has lapsed unfortunately for the moment so im making a list of tests to get done once it picks up again in a few months... my grandmother just had her gallbladder out and it turns out that was the root of her heart problems. blew my mind!"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-17T02:11+00:00", 
            "reply_content": "A HIDA scan checks to see if bile is moving through your body in a normal way.   It can detect gallstones and an inflamed gallbladder too.  So it covers more than a gallbladder ultrasound."
        }, 
        {
            "reply_author": "ashton007", 
            "reply_time": "2019-03-17T18:58+00:00", 
            "reply_content": "ahh i see. im very interested in getting that done!!"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-18T00:52+00:00", 
            "reply_content": "At least it will help to rule out possible gallbladder problems."
        }, 
        {
            "reply_author": "ashton007", 
            "reply_time": "2019-03-18T17:17+00:00", 
            "reply_content": "exactly! thank you!"
        }
    ], 
    "post": "Hi there. I’m a 24 year old female who has been plagued by health issues for the last several years. It’s taken such a tole on my life and happiness, and no dr or specialist can seem to make heads or tales of what’s happening to my body so I’ve turned to the internet to see if anyone out there has any ideas or suggestions.\nIt all started in 2015 when I went to a music festival in Chicago and came down with bronchitis that I couldn’t get over for 5 months. I was prescribed prednisone, albuterol inhaler treatments and Bactrim. After taking the Bactrim I started having severe stomach burning pain, high \n, \n and extreme nausea. I discontinued use and couldn’t get rid of the nausea. I weighed 123 and I’m 5’5’ and I lost 15 lbs due to the nausea being so bad. I could have a few crackers a day and that was it. Over the next few months my stomach got a minuscule amount better but I was still plagued with constant nausea. I had my gallbladder checked and tried eliminating certain foods to see if they were a trigger but nothing seemed to help. This constant nausea continued until 2017 and was bad enough that it made it hard to keep a job. I felt miserable all the time. I only ever seemed to feel better when I would get super hungry, but the nausea would return full force once I ate. In 2017 I had a horrible week of nausea, then all the sudden I came down with a fever of 104°, agonizing body and joint aches, numb lips and hands and a splitting \n. This continued through the night. I took 2 Tylenol pm and woke up the next morning feeling so much better. After this incident my stomach seemed to have improved a lot! I could eat more consistently and the nausea, though still present, was lessened. I would still have some good days and some worse days, which always seemed random. If I woke up nauseous, I was nauseous the whole day. Flash forward to 2019. New Year’s Eve I suddenly had a fainting spell where I got incredibly nauseous, sweaty, couldn’t hear or see and it took a long time for my senses to come back. Once they did, I couldn’t stop shivering. These fainting/dizzy spells have now continued nearly every day and most often occur in the mornings. I’m struggling again with more consistent nausea and that on top of the fainting has me grasping at any strings I can find. I recently had an upper endoscopy which came back mostly normal aside from some light acid damage.\nIf you have any insight into what this could be or anything that could help, please please tell me!!!", 
    "author": "ashton007", 
    "title": "My medical mystery "
}
{
    "reply": [], 
    "post": "Hi wondering if anyone has done the Genova Diagnostics GI Effects stool test with the add on to have yiur zonulin level checked for leaky gut.  I think the normal reference range ended at 161  and my result was 296:(\nI know gut health is all you hear about these days and leaky gut is the cause of so many things supposedly.  I have debilitating \n and an eating disorder because of my digestive issues and for other reasons that i wont go on and on about.  Am i over thinking the leaky gut thing.  Its killing me or at least i wish it would already with all of my symptoms.", 
    "author": "susan39015", 
    "title": "LEAKY GUT- ZONULIN TEST"
}
{
    "reply": [
        {
            "reply_author": "glenn06752", 
            "reply_time": "2016-07-25T19:27+00:00", 
            "reply_content": "Hi Sara - sorry to hear about the annoying burping. I had a similar situation with burping and plenty of gas. I've had several endoscpies along the way and diagnosed with Barrett's Esophagus, or better known as GERD or acid reflux. Barretts can be serious as the acids from the stomach can eventually cause esophogeal  . Therefore, it's important to keep the gas to the lowest possible level.  Anyway, to answer your question, the only medication that helped me substantially was a med called PANTRAPAZOLE -40 MGS.. Now, no two people are alike and what may work for me, may not work for you, etc, but that's my story. One pill in the morning and there's no belching or gas for 24 hours. Of course a sensible diet helps too, staying away from the fatty foods and spicy sauces, etc.  I hope you find relief in your burping. I know how annoying it can be. Mine would coe and go and when it was in rare form, it was a nightmare. Take care, Glenn"
        }, 
        {
            "reply_author": "sanjeevbhatt", 
            "reply_time": "2016-07-26T02:31+00:00", 
            "reply_content": "Please go for an endoscopy.                    "
        }, 
        {
            "reply_author": "unlucky63610", 
            "reply_time": "2016-07-26T04:32+00:00", 
            "reply_content": "Sanjeev i haVe endoscopy which didnot show any problem Nd fro. Last three and half years i burps on daily basis for hours.....some time i have sour taste in my mouth but very often....and have lot of gas ....whats that then? I tried omeprzole and esmoprazole lansoprazole no thing work for me.......i have panic attacks like i have heart attack done echo and 8+ ecgs blood stool test ultra sounds,tyroid test,recently endoscopy all of that is clear till now what should i do every day i have panic attack i feel like i have heart attack then after short time burps starts i am dealing with it from,last 3 and half years.....don't knkw what to do"
        }, 
        {
            "reply_author": "Sara_73196", 
            "reply_time": "2016-07-26T11:41+00:00", 
            "reply_content": ""
        }, 
        {
            "reply_author": "levin", 
            "reply_time": "2017-07-11T20:51+00:00", 
            "reply_content": "I wanted to share this with you. I having excessive belching and breathing difficulty. I noticed that after I force myself to burp, more aire immediately moves into place. My problem was caused from mold exposure. After a year or so of multiple exposures, I started belching. When it is bad, I belch up to 3 hours constantly. When it isn't bad, I belch throughout the day but not as much. It's still uncomfortable. Because I was exposed to mold, my lung movement became impaired. This felt like if I had taken a deep breath and held it in and could not relax my lungs to push the air out. In other words, my lungs were stuck in an over inflated /expanded position all of the time. When I have air in my stomach (bloated), I can feel the air pushing upward on my diaphragm preventing the diaphragm from downward movement when breathing in. The bloating pushes up on my diaphragm and my lungs have less room to expand. A   confirmed that my lungs were over expanded. My lungs are a little better now, but not fully recovered as is evidenced by my impaired lung movement when I am bloated. After I intentionally burp, I can breathe easier.  I find that when I lied down I breath the easiest. I believe this is because the air is pushing against the inside of my abdomen, not diaphragm. "
        }, 
        {
            "reply_author": "syed87746", 
            "reply_time": "2018-01-22T04:48+00:00", 
            "reply_content": ""
        }, 
        {
            "reply_author": "nar1505", 
            "reply_time": "2018-03-15T18:14+00:00", 
            "reply_content": "I am suffering from same problem and I have been seeing different doctors since 1 year and all my tests including endoscopy,   are normal. Can you please help me on what is your problem and how did you overcome it. Thanks Nar                     "
        }, 
        {
            "reply_author": "angela05289", 
            "reply_time": "2018-06-18T18:18+00:00", 
            "reply_content": "I have these very same symptoms. How did you find out and confirm the mold exposure and symptoms were connected to that.  I am concerned that this may be my situation.  And lastly, what did you do to treat your symptoms and your body for the mold exposure.?.? Thanks in advance.                    "
        }, 
        {
            "reply_author": "sanjeevbhatt", 
            "reply_time": "2016-07-26T13:10+00:00", 
            "reply_content": "You should not take tension. Peptic ulcer takes time to heal. It's not a day or two days procedure. Patience is the key...."
        }, 
        {
            "reply_author": "Sara_73196", 
            "reply_time": "2016-07-26T20:45+00:00", 
            "reply_content": ""
        }, 
        {
            "reply_author": "unlucky63610", 
            "reply_time": "2016-07-26T21:42+00:00", 
            "reply_content": "Sara do you have an endoscopy that your doctor will say that you havd peptic ulcer if you have endoscopy and it shows ulcerso then be patient bcoz it take time to heal....if you don't hVe endoscopy then its possible that your doctor may be wrong bcoz i have lot of burps more then 500 times in a day...i have endoscopy it didnot show any ulcer or barretts in esophagus.....such a bad i suggest if you didnot do endoscopy better to go for it"
        }, 
        {
            "reply_author": "Sara_73196", 
            "reply_time": "2016-07-27T12:15+00:00", 
            "reply_content": "Hello no I didn't do an endoscopy- the doctor just diagnosed me with it . So u still have burping presently ? Do you know what brought it on or have you been diagnosed with something else ? I feel at my wits end I don't know what to do . Please tell me your doc found a cure for you . Thanks "
        }, 
        {
            "reply_author": "unlucky63610", 
            "reply_time": "2016-07-29T12:01+00:00", 
            "reply_content": "Nope my doctor say to me its acid refluxi remember when doc is doing endoscopy for me i was sos cared and thinking may b there will be some problem and i am talking somd time to my doc that whats in my endoscopy he say its clear no problem.....he give me nexium for one month but didnot work on me....i still hVe lot of burps a day like more then 800 to1000 time or may b more some time not to much .....when ever i am eating i feel my breath stops and i am always worried and feel heavy on my left side chest think that any time i have heart attack i feel to bad i feel my breath stops my heart stop beating then after some time burps will start for hours then i become fine.....believe me we are not Lone i hVe co worker now he is new he also have sams symptoms like me....well next sunday i have colonscopy if that is clear i think i should discuss abiut Nissen fundopolictaion surgery with my doci am tired i m 30 years old and every time                    "
        }, 
        {
            "reply_author": "unlucky63610", 
            "reply_time": "2016-07-29T12:04+00:00", 
            "reply_content": "Burps alot ....have panic attacks.......specially when i hear about some one that he or she will die from heartattack and cancer thats it  i have a panic attack then to scared of this....can't figure but since fromshenihave gall bladder surgery i am facing like that but i didnot focus but now i can not live like thatwhats that i will figure it out if possible other then that do fundoplication surgery if by doing that my panic attacks and burps will stop i will up,date you here then"
        }, 
        {
            "reply_author": "shirley_23744", 
            "reply_time": "2017-01-03T04:47+00:00", 
            "reply_content": ""
        }, 
        {
            "reply_author": "levin", 
            "reply_time": "2017-07-11T22:43+00:00", 
            "reply_content": ""
        }, 
        {
            "reply_author": "syed87746", 
            "reply_time": "2018-01-22T04:51+00:00", 
            "reply_content": ""
        }, 
        {
            "reply_author": "alex9225", 
            "reply_time": "2018-06-07T17:53+00:00", 
            "reply_content": ""
        }
    ], 
    "post": "I have been taking nexium for the past two weeks to relieve constant burping. I took some weight loss meds that i have since discontinued on the doctor's advice and i had vomited that particular day and suddenly i was burping all the time.\nI do not believe the nexium is working ...my doctor says i need to take it for as little while longer.....Has anyone ever had constant burping like this ?  Will i ever go back to normal? What can i do/take to stop this? It is driving me insane - like seriously . Could tking those pills for one day really cause this or the vomiting? I welcome ur help/advice..Thank : ) ", 
    "author": "Sara_73196", 
    "title": "Constant burping ...no pain or heartburn"
}
{
    "reply": [
        {
            "reply_author": "Joannwilson", 
            "reply_time": "2019-03-31T07:04+00:00", 
            "reply_content": "One thing, I don't know your age, but have you ever had a bad head injury? I ask because I had a lot of those kind of things and it was not until I got thyroid tests that they saw I had bad results. I also had problems with my pituitary function. I thought I had so many different problems and no answers and researched each little thing trying to figure it out. They can test your thyroid levels and go from there. It might take more than 1 test to compare at different times but its worth asking just to set your own mind at ease. A head injury can set off pituitary problems in women."
        }, 
        {
            "reply_author": "Rainbow78", 
            "reply_time": "2019-03-31T07:51+00:00", 
            "reply_content": "Sounds like me when i my diverticulitis attacked ... I was told its for the last 20 years , then my bowel perforated resulting in emergency surgery , they thought it was appendix but upon looking through a camera they see it was much more than that.  So i had a right hemicolectomy  to remove the infected bowel.  Previously though twice i had a   and   and they said all appeared normal in the bowel but they could not reach all the way round due to scar tissue? But assumed it looked normal.  They were very wrong.  So diverticulitis got infected and it perforated my bowel.  20 years treated for ibs ,, i also get amemic often and need high protein and high fibre and high water intake to help my body get goodness as my Cecum was infected for so long causing bloating nausea extreme pain after food,  felt like i couldn't eat or drink as not long after i would be crippled with pain.    i suffer with too but I have high  ,  ocds too so secret worrying causes this i think. Please ask them to check for other bowel diseases.  I was clear on all tests so there must be better ones out there as all omg it was not clear."
        }, 
        {
            "reply_author": "Rainbow78", 
            "reply_time": "2019-03-31T07:52+00:00", 
            "reply_content": "Sorry meant to say I was told IBS for 20 years ..."
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-31T11:30+00:00", 
            "reply_content": "IBS is different for everyone so it is possible to get localised pain from IBS.   Your doctor is right about this.   Some people get shifting pain, come and go pain or it can be generalised or constant.  No one person is the same.    When you have an ultrasound, all abdominal organs are scanned, including your gallbladder.  If gallbladder problems were found, you would have been told.    However, if you are still stressing about your gallbladder, ask for a HIDA scan to check gallbladder function. On the other hand, since all your tests have been negative, I would accept your doctor's diagnosis of IBS.   Your doctor is the expert.  IBS doesn't show on scans and tends to stay in flare up mode if you have ongoing  .  You could try the Low Fodmap Diet or a food diary and try relaxation techniques.    Do you find your symptoms subside when you are busy?  This can be a sign of IBS.  Try light exercise such as walking or a hobby which can help to take your mind off your symptoms."
        }, 
        {
            "reply_author": "Cooper1965", 
            "reply_time": "2019-03-31T12:41+00:00", 
            "reply_content": "Im sorry, but i dont put as much blind faith in doctors as you seem to, I mean she’s lost a load of tests, admitted to doing wrong tests and once got me confused with another patient, file out and all, if I had your blind faith and just ran with it who knows what would have happened. IBS is also not a disease its a symptom of something greater. If you had brittle bones, and went to the doctor and said, I have broken my bones multiple times this year. And she said. Sorry you have BBS brittle bone syndrome, try not to move as much and not walk to quickly. Maybe buy some padding. You would shake your head in disgust. I think you would try to find out why your bones were brittle and how to get them back to a strong state. Telling me I have IBS for no reason, that it won’t get any better, that I just need to go home and limit what I eat and hope for the best is utterly ridiculous. Your bowel doesn’t just become irritated, that is a symptom of a greater problem. Limiting food may help it heal. But why has it gotten so weak in the first place? I’m 30 btw"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-31T13:47+00:00", 
            "reply_content": "I do not have blind faith my doctor.  My belief in what I was told is based on the fact that I was correctly diagnosed with IBS when my other doctors failed.  I was diagnosed with stress related IBS  and this was true because stress preceded my symptoms. While I am calm, I have no symptoms, but when I get anxious, my symptoms come back.  IBS is not necessarily a symptom of something greater.  I have nothing else worse going on with my gut.   Some people may have other things going on but this is not always the case.  IBS is not a cut and dry syndrome.  This why it is so difficult to diagnose and treat. I found that as soon as I trusted my doctor and accepted my diagnosis, my health anxiety and IBS got much better,  However, since your doctor has made mistakes, you should see someone else you can trust.  If you are given the same diagnosis by your new doctor, then you should accept it.  I had no faith in the first few doctors I saw  because they couldn't help me, but my last doctor identified my symptoms and that's why I trusted him.  Try seeing different doctors and this may give you the reassurance you need and the correct diagnosis and treatment."
        }, 
        {
            "reply_author": "Joannwilson", 
            "reply_time": "2019-03-31T22:10+00:00", 
            "reply_content": "I myself had a multitude of tests until I felt like the medical staff thought I was a hypochondriac. I totally felt every visit I had to start over from scratch. I saw countless experts but until one simple remark led them to realize all the symptoms combined into one diagnosis. A physician sees you for one visit and often pressed for time due to government or private constraints. Seeing so many patients a day or even as you noted getting someone's information misfiled. I was asked my height  and said funny thing is I seem to have grown a couple of inches, and I was then in my fifties. This was after all kinds of tests. labs, X rays  scans, you name it. One week before my gallbladder burst I had a clean bill of health. A lot can change in a week. I got sepsis and even the ambulance guys thought I could safely get to the hospital on my own. I insisted they transport me so they could at least start an Iv. I am not saying my case is typical but if I had not insisted I would not be here today. If you do not think the staff is correctly treating you, get another opinion. A second opinion or how ever many it takes. A co worker just went through the bowel problems mentioned by another person here. Physicians can be mistaken like any other person. It is your body and your life. You know what is typical or normal for you, individually. No two people are exactly the same. It can cost more to get answers but can you put a price tag on your health?"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-31T22:50+00:00", 
            "reply_content": "I felt exactly the same way until I was diagnosed with IBS. I felt like a broken record with every doctor I saw.  The funny thing was I was so anxious about not getting answers that I had forgotten that I had had six months of stress before my symptoms appeared.  I hadn't been aware of the toll the stress had taken on my health.   It was the doctor asking me if I had had any recent stress that got me diagnosed.  I hadn't thought to mention it to my previous doctors because I hadn't thought it relevant.   I assumed it to be something more serious than simple stress."
        }, 
        {
            "reply_author": "Joannwilson", 
            "reply_time": "2019-03-31T22:19+00:00", 
            "reply_content": "Over the last ten years I saw so many different physicians I lost count. So one day they asked what was bothering me the most. Until then I had not thought of prioritizing my health as to which ones I had already got used to and which I could not deal with for one more day. They add up taking a mental and physical toll. I am no expert but I do know how much I can endure and when to cry uncle. Don't get discouraged from advice here or from anywhere else. Simply state what your limits are and what your expectation as reasonable care is. Put it this way. You take a pet to the vet and you have to speak for your pet, as they can not voice their concerns. Would you not expect the same consideration from a doctor?"
        }
    ], 
    "post": "In October 2018 I Started to feel a pain on my right side between my hip and my lower ribs.\nAbout this time i started to see what i thought was blood in my stool. It would seep out like a soaked rag, red all the way through.\nI went to the doctor they did blood tests, stool tests. The pain was slight and i had no other issues.\nBy January 2019 the pain had doubled, i now was not digesting food correctly, sometimes food would sit in my stomach for over half a day, leaving me bloated, burpy and really uncomfortable.\nAt the end of January i had an attack of sorts, had a large fatty meal. My body shut down, my right side was in so much pain. I also just felt poisoned, my urine was also this dark red colour over this time. The pain got so bad i had to go to hospital, where they said it was IBS and to go home.\nI Went back to the doctors, they did liver function tests, red/ white bloods, all the normal. stool test for blood and celiac disease, all came back “normal”. I stressed that I thought this was gallstones or an issue with my pancreas and asked for an Ultrasound. It was a 3 week wait for my letter for the appointment for the ultrasound then a further 2 weeks for the ultrasound itself.\nA week after the ultrasound I had another attack, this one was worse. I had cured meats one night, and again body shut down. This time there was vomiting, shivering, and huge inflammation from my stomach through my full intestines. My urine again was dark red. I had diarrhoea for 3 full days, every 15 minutes. I couldn’t eat, hardly slept. Due to the loss of electro lights my muscles started to ache and my toes started to curl and hurt. Started taking electro lights after this started to happen, stopped the muscle pain.\nThe diarrhoea was red, then it was just mucus, red/orange. Every time I drank water, more mucus would come out of me. I tried everything to stop from continually going to the toilet, out of desperation as I thought this was going to be my life from now till I died, I took a steroid anti inflammatory that my partner had left over from a treatment. Within 20 minutes the diarrhoea stopped. The pain went down. And I could eat again. But I had practically no stomach acid. Anything I ate sat in my stomach, caused huge amounts of pain. Passing through me mostly undigested. At this point I was on boiled rice and boiled chicken.\nI bought stomach enzymes, bile salts and stomach acid pills. Food was now being digested and now I had solid stools.\nI waited two weeks for my ultrasound which I got the results over the phone, they said it was fine no issues. Then 2 week wait to see my doctor to go over the results. She didn’t have the scan, only the letter from the radiologist, which stated the size of my kidneys was normal. Which isn’t really what I had the ultrasound for. No mention of my gallbladder or anything else. I was told I might need to wait for another ultrasound, at this point she had no record of the tests in January. So I had to have them all redone as well. That was Friday the 29th of March.\nI am still in a lot of pain, my right side is really sore. I am still seeing what looks like blood seeping out my stool. I have stopped taking the acid pills, but continue with the bile salts and the enzymes.\nI have no pain lower down only my right side and my stomach. I had tests for a urine infection when I had my first attack as well as checking my appendix. I’ve also had tests for helicobacter pylori No signs of anything.\nThe doctor after her about the lack of stomach acid, prescribed me omeprazole and peppermint capsules. I asked, if I feel as if I’m not digesting food, even to the point of supplementing my stomach acid, why prescribe something to reduce the stomach acid in my stomach. She said it would “create a protective barrier” which I’m not quiet getting.\nShe has stated on every occasion that I have IBS and that’s that. When I said the highly localised pain isn’t a symptom of ibs usually. I was told that it can happen.\nLong term problems that might be import, maybe?\nin my late teens and early 20s I had random rush’s of adrenaline my heart would race for no reason, beat out of my chest. Then stop. They tested my heart, refused to test my adrenals. It got less frequent over years. Then stopped.\nHigh carb meals since 13/14 years old till today have made me drop a sleep for 12 hours plus once for 48 hours. I started taking modafinil in my 20s to stay awake. This was on off till I gave up carbs.\nMid 20s I gave up carbs and went on a low carb diet for 5 years it changed my life I stopped falling a sleep and felt more present. Before this I gave up gluten. It helped but not as much as giving up a high carb diet. ive had to give this up since oct 2018.\nI have had ADD for most of my life, I have only recently been diagnosed as I now have the money to see a specialist. However the stimulants put me to sleep. No matter how many I take. I have been prescribed Adderall and Ritalin and Vyvanse, all of which have had no effect other than to put me to sleep. My doctor doesn’t really understand why. Since my mid 20s I have started to lose my hair and have scalp acne, it is almost constantly sore. I’ve tried every shampoo with no SLS or no additives. Baking soda. No shampoo. Etc. Everything you could think of. Nothing. Scalp feels soft, red, swollen.\nAny help with my failing body would be amazing.\nI feel as if my doctor wants me to just admit that this is it and not come back. But I’m seeing her in two weeks. So any help you can give me would be really beneficial.\nThank you\nCooper", 
    "author": "Cooper1965", 
    "title": "Mystery, just no idea "
}
{
    "reply": [
        {
            "reply_author": "eric31962", 
            "reply_time": "2019-03-21T21:30+00:00", 
            "reply_content": "Dear Jason 555, I wish to hell that i could write a learned explanation of what may be wrong. My own brother has the same condition and despite constant hospital tests we cannot find a solution.  Nausea is a most disabling condition and hard to live with. I had a related condition in 2014  which was kidney based. I was ill for months, and in hospital too. I was eventually admitted to a teaching hospital who put me onto emergency dialysis. It took a year of treatment before I became even fairly well. Be cautious of crank treatments and diets, desperate people are an easy market for con merchants. Keep going to the doctors and keep a diary of your symptoms. Try a different doctor or hospital. Regards, E"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-22T01:54+00:00", 
            "reply_content": "Ask for anti nausea/anti emetic medication to help you to eat more normally.  Has your doctor not suggested these medications to you?"
        }, 
        {
            "reply_author": "jason555", 
            "reply_time": "2019-03-22T19:27+00:00", 
            "reply_content": "He hasn't suggested anything. I did every test possible already and everything was fine but he would just give me a note to go get more of the same tests done again. Should I go in and ask for them directly?"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-22T23:36+00:00", 
            "reply_content": "I would ask your doctor for an anti nausea med to help with your symptoms.  Since you have had a diagnosis of functional dyspepsia, further tests won't show anything because the problem is functional rather than an issue with a particular organ."
        }, 
        {
            "reply_author": "ren56472", 
            "reply_time": "2019-03-27T20:11+00:00", 
            "reply_content": "i have the exact same thing. ive seen every doctor, specialist, have had every exam/test possible and two explorative surgeries. cant really find anything... they are continuing to stick with severe  . i tried everything i could naturally and then tried amitriptyline 10mg for about 5 months but i didnt like the side effects so i took myself off of them. im at a point where i have to believe its anxiety and its the only way im going to make it out of this. im done exploring because it caused me to get worse. im going to start seeing a really good therapist about it (ive seen two but they were mediocre). i was recently doing better but have \"relapsed\" again. its legit torture and not having answers wrecks havoc on the whole situation. youre not alone and if your doctors have searched everything, maybe its smart to see about getting medicated and maybe cbt with a therapist? ive done it all but never have been too extreme about anything as i am an overly cautious person. i think its time to kick this illness in the ass as it has done me. message me if you ever just need to vent!!! -Reni"
        }, 
        {
            "reply_author": "jason555", 
            "reply_time": "2019-03-27T20:45+00:00", 
            "reply_content": "Thank you for the reply! I'm so sorry you're going through this but I'm incredibly relieved I found someone like me... For such a long time I've felt like I'm the only person in the world going through this. I've been to a psychologist which was no help at all and two psychiatrists but to no avail. None of them knew what to do, what caused it or how to make it better. I take sulpiride 1 pill of 50mg daily and 5mg diazepam pills \"as needed\". I've too been to every possible test in the past year and a half and am going for a complete blood work test, as suggested by my psychiatrist. If you find something that helps, anything at all please contact me I would love to hear how you progress. Best of luck, I know how you feel."
        }, 
        {
            "reply_author": "hlthhlthhlth", 
            "reply_time": "2019-03-31T11:26+00:00", 
            "reply_content": "Jason have you tried taking probiotics? Yogurts and Kefirs are good sources of probiotics. These are healthy bacteria that will help to regulate gut health and help with digestion related problems. From my experience, one of the safest and most effective ways out of digestive problems are probiotics. Probiotic supplements are also a good choice too. Specifically I would recommend Flourish Probiotics by Eu Natural. This is a combination of safe healthy bacteria that helps to support digestion, gut and urinary tract health. A safe way to get rid of nausea and other digestion related problems. I would recommend you check it out. Good health to you"
        }, 
        {
            "reply_author": "arvbuttar", 
            "reply_time": "2019-03-31T16:59+00:00", 
            "reply_content": "Hi, I read your post. I think, you should visit an experienced doctor ASAP. Thanks"
        }
    ], 
    "post": "Hi. So I've been diagnosed with functional dyspepsia and am dealing with constant nausea on the daily. I'm dealing with it for a long time, 2 years now and it gets better but it always eventually comes back and I feel like dying would be easier then not eating and vomiting daily every two months, then beginning to eat more normally with nausea and then relapsing again. It gets worse when I have to eat and I can barely get enough food down to function. I also can't drink as much as I should (\n and \n every day). Some days I throw up when I wake up, or if I'm not careful with how much I eat at once. Has anyone experienced this and/or has a solution? Is there any medication I should ask my doctor for? It's really destroyed my social, personal and family life. I can't enjoy a nice dinner, going out with friends, going to see a new movie, birthdays, parties, weddings etc.\nAll input and opinions are welcome.", 
    "author": "jason555", 
    "title": "Every day debilitating nausea, hard to eat or drink."
}
{
    "reply": [
        {
            "reply_author": "lester90053", 
            "reply_time": "2019-03-30T22:43+00:00", 
            "reply_content": "If this repeats itself consult a dietition to review your meals and offer advice."
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-30T23:53+00:00", 
            "reply_content": "Try not to worry, stool colour change and acid reflux are common with IBS.  Staying calm will help you manage your symptoms but   will make them worse.   Simply try a food diary to see what foods may be going through you too quickly.  Fast transit time can cause yellow stools.  Try   or milk for reflux; this works for me.  My IBS is in remission because I do not let it worry me and I avoid things that cause me stress.  These are your best options to help your IBS."
        }, 
        {
            "reply_author": "carl67287", 
            "reply_time": "2019-03-31T00:44+00:00", 
            "reply_content": "have you had yellow smelly stools before ?"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-31T01:12+00:00", 
            "reply_content": "My stools have never been yellow and I don't know whether they have been smelly because my sense of smell is poor.  However, IBS is known to cause the symptoms you are having.  Everyone experiences IBS differently so no one person will have the exact same symptoms as another.  IBS is very individual.    A food diary,  trying to stay calm and taking antacids can help."
        }, 
        {
            "reply_author": "jeff4242", 
            "reply_time": "2019-03-31T04:56+00:00", 
            "reply_content": "Hi Carl. Was it bright yellow? or yellowish brown? and is it in a daly basis? Have you had any test before, recently? like bloodworks, ultrasound, stool test?"
        }, 
        {
            "reply_author": "carl67287", 
            "reply_time": "2019-03-31T05:34+00:00", 
            "reply_content": "always yellow and yes all tests and "
        }, 
        {
            "reply_author": "carl67287", 
            "reply_time": "2019-03-31T05:35+00:00", 
            "reply_content": "what are your thoughts"
        }, 
        {
            "reply_author": "jeff4242", 
            "reply_time": "2019-03-31T06:03+00:00", 
            "reply_content": "show tests didn't show anything? do you know your Bilirubin levels on your bloodwork? I do experience having yellowish stool from time to time and i have gallstones..i don't know if it's related. It  could be liver problems or as simple as IBS. Gagging or feeling somethings stuck on throat could be GERD. Do just a simple heartburn"
        }, 
        {
            "reply_author": "hlthhlthhlth", 
            "reply_time": "2019-03-31T10:09+00:00", 
            "reply_content": "Carl, try taking probiotics. When it comes to digestion and gut help, believe me these are one of the safest and best way to get relief. Probiotics are basically healthy bacteria that support our gut, digestion and urinary tract. They are necessary for the correct functioning of our system and stronger immunity. Sadly various medications we take like   tend to kill both the good and bad bacteria, as a result gut flora is poor and various complications arise as a result. So my advise to you is to boost your diet on probiotics. Eat some yogurt, kefir or fermented milk. If your condition is too serious and you need immediate relief, use probiotic supplements. I would recommend Flourish Probiotics by Eu Natural. This is basically a combination of healthy bacteria that will support your digestive system, support your gut health and improve your overall well being. And drink a lot of water. Check it out and let me know what you think."
        }, 
        {
            "reply_author": "lester90053", 
            "reply_time": "2019-03-31T13:11+00:00", 
            "reply_content": "All the probiotics I have seen on the market are unregulated."
        }
    ], 
    "post": "i suffer really bad health anxiety i have constant yellow stools and this morning about 3am i woke up with acid reflux in my throat and gagging on it.\nit was horrible does anyone else get this or had this i havent had it in ages and it scares me\ni felt really bloated too.", 
    "author": "carl67287", 
    "title": "Reflux"
}
{
    "reply": [
        {
            "reply_author": "carl67287", 
            "reply_time": "2019-03-30T22:16+00:00", 
            "reply_content": "do your stools really stink ? and often yellow loose stools ?"
        }, 
        {
            "reply_author": "Cooper1965", 
            "reply_time": "2019-03-30T22:23+00:00", 
            "reply_content": "tbh  they have been all different colours 😄 for a long time they were a greeny yellow and they stank. I mean they still stink, but they are mostly a burnt red, with red that seeps out"
        }, 
        {
            "reply_author": "lester90053", 
            "reply_time": "2019-03-30T22:23+00:00", 
            "reply_content": "An incredible story."
        }, 
        {
            "reply_author": "Cooper1965", 
            "reply_time": "2019-03-30T22:24+00:00", 
            "reply_content": "#NHS"
        }
    ], 
    "post": "In October 2018 I Started to feel a pain on my right side between my hip and my lower ribs.\nAbout this time i started to see what i thought was blood in my stool. It would seep out like a soaked rag, red all the way through.\nI went to the doctor they did blood tests, stool tests. The pain was slight and i had no other issues.\nBy January 2019 the pain had doubled, i now was not digesting food correctly, sometimes food would sit in my stomach for over half a day, leaving me bloated, burpy and really uncomfortable.\nAt the end of January i had an attack of sorts, had a large fatty meal. My body shut down, my right side was in so much pain. I also just felt poisoned, my urine was also this dark red colour over this time.  The pain got so bad i had to go to hospital, where they said it was IBS and to go home.\nI Went back to the doctors, they did liver function tests, red/ white bloods, all the normal.  stool test for blood and celiac disease, all came back “normal”. I stressed that I thought this was gallstones or an issue with my pancreas and asked for an Ultrasound. It was a 3 week wait for my letter for the appointment for the ultrasound then a further 2 weeks for the ultrasound itself.\nA week after the ultrasound I had another attack, this one was worse. I had cured meats one night, and again body shut down.  This time there was vomiting, shivering, and huge inflammation from my stomach through my full intestines. My urine again was dark red. I had diarrhoea for 3 full days, every 15 minutes. I couldn’t eat, hardly slept. Due to the loss of electro lights my muscles started to ache and my toes started to curl and hurt. Started taking electro lights after this started to happen, stopped the muscle pain.\nThe diarrhoea was red, then it was just mucus, red/orange. Every time I drank water, more mucus would come out of me. I tried everything to stop from continually going to the toilet, out of desperation as I thought this was going to be my life from now till I died, I took a steroid anti inflammatory that my partner had left over from a treatment. Within 20 minutes the diarrhoea stopped. The pain went down. And I could eat again. But I had practically no stomach acid. Anything I ate sat in my stomach, caused huge amounts of pain. Passing through me mostly undigested. At this point I was on boiled rice and boiled chicken.\nI bought stomach enzymes, bile salts and stomach acid pills. Food was now being digested and now I had solid stools.\nI waited two weeks for my ultrasound which I got the results over the phone, they said it was fine no issues. Then 2 week wait to see my doctor to go over the results. She didn’t have the scan, only the letter from the radiologist, which stated the size of my kidneys was normal. Which isn’t really what I had the ultrasound for. No mention of my gallbladder or anything else. I was told I might need to wait for another ultrasound, at this point she had no record of the tests in January. So I had to have them all redone as well. That was Friday the 29th of March.\nI am still in a lot of pain, my right side is really sore. I am still seeing what looks like blood seeping out my stool. I have stopped taking the acid pills, but continue with the bile salts and the enzymes.\nI have no pain lower down only my right side and my stomach. I had tests for a urine infection when I had my first attack as well as checking my appendix. I’ve also had tests for helicobacter pylori No signs of anything.\nThe doctor after her about the lack of stomach acid, prescribed me omeprazole and peppermint capsules. I asked, if I feel as if I’m not digesting food, even to the point of supplementing my stomach acid, why prescribe something to reduce the stomach acid in my stomach. She said it would “create a protective barrier” which I’m not quiet getting.\nShe has stated on every occasion that I have IBS and that’s that. When I said the highly localised pain isn’t a symptom of ibs usually. I was told that it can happen.\nLong term problems that might be import, maybe?\nin my late teens and early 20s I had random rush’s of adrenaline my heart would race for no reason, beat out of my chest. Then stop. They tested my heart, refused to test my adrenals. It got less frequent over years. Then stopped.\nHigh carb meals since 13/14 years old till today have made me drop a sleep for 12 hours plus once for 48 hours. I started taking modafinil in my 20s to stay awake. This was on off till I gave up carbs.\nMid 20s I gave up carbs and went on a low carb diet for 5 years it changed my life I stopped falling a sleep and felt more present. Before this I gave up gluten. It helped but not as much as giving up a high carb diet. ive had to give this up since oct 2018.\nI have had ADD for most of my life, I have only recently been diagnosed as I now have the money to see a specialist. However the stimulants put me to sleep. No matter how many I take. I have been prescribed Adderall and Ritalin and Vyvanse, all of which have had no effect other than to put me to sleep. My doctor doesn’t really understand why. Since my mid 20s I have started to lose my hair and have scalp acne, it is almost constantly sore. I’ve tried every shampoo with no SLS or no additives. Baking soda. No shampoo. Etc. Everything you could think of. Nothing. Scalp feels soft, red, swollen.\nAny help with my failing body would be amazing.\nI feel as if my doctor wants me to just admit that this is it and not come back. But I’m seeing her in two weeks. So any help you can give me would be really beneficial.\nThank you\nCooper", 
    "author": "Cooper1965", 
    "title": "Undiagnosed since Oct 2018 "
}
{
    "reply": [
        {
            "reply_author": "mary19068", 
            "reply_time": "2019-03-29T11:09+00:00", 
            "reply_content": "Hi Fearheartprob Do you do a lot of weight lifting and exercise if so you could be releasing too much cortisol from your adrenals that sit on top of your kidneys. Extreme exercise can release too much cortisol and your heart will take a while to return to normal beating. Ask f tor to check your cortisol levels..."
        }, 
        {
            "reply_author": "Fearheartproble", 
            "reply_time": "2019-03-29T12:06+00:00", 
            "reply_content": "What is cortisol level. I have this probem from 5 year. Please tell me what i do."
        }, 
        {
            "reply_author": "Sway", 
            "reply_time": "2019-03-29T12:37+00:00", 
            "reply_content": "Don't bother Mary. Look at the other post. he's attention seeking and it's getting out of hand. he changes usernames, symptoms and everything. you're wasting you're time."
        }, 
        {
            "reply_author": "mary19068", 
            "reply_time": "2019-03-29T14:31+00:00", 
            "reply_content": "Hi Sway Thank you for your advice. Yes, his arteries and   are fine.  Perhaps docs are missing something do you think?"
        }, 
        {
            "reply_author": "mary19068", 
            "reply_time": "2019-03-29T14:38+00:00", 
            "reply_content": "Hi Fearheartproblem Cortisol is a hormone released from the adrenals that sit on top of your kidneys. It helps with 'flight or fight process' when we are stressed. It can become at a high level if you work out intensively and can cause problems. Have you been x-rayed at all for a Aortal Aneurysm. This usually affects older men, but you don't say how old you are. An Aortal Aneurysm is a swelling in the aorta the main artery from the heart...ask your doc have you been checked for this. If all your tests are ok, which they are, you should stop stressing and making yourself worse. Stress is a huge no no for our health. ."
        }, 
        {
            "reply_author": "Sway", 
            "reply_time": "2019-03-29T15:38+00:00", 
            "reply_content": "anything is possible.  I sent you a message.  also He is a 38 year old Male that lives in Pakistan. so he says."
        }, 
        {
            "reply_author": "mary19068", 
            "reply_time": "2019-03-29T11:25+00:00", 
            "reply_content": "Hi Fearheartproblem"
        }, 
        {
            "reply_author": "Fearheartproble", 
            "reply_time": "2019-03-29T12:04+00:00", 
            "reply_content": "Now i cannot do any exercise. If o dont i have werid feeling in my heart. It sinking. I did gym 14 year ago."
        }, 
        {
            "reply_author": "mary19068", 
            "reply_time": "2019-03-29T16:01+00:00", 
            "reply_content": "Hi Fearheartproblems I would suggest that you request your doctor to refer you fir Cognitive Therapy for your   and hypochondria. It would be more helpful if you spent your money having Cognitive Therapy to help you."
        }, 
        {
            "reply_author": "Fearheartproble", 
            "reply_time": "2019-03-29T20:42+00:00", 
            "reply_content": "You know i live in devrloping country. I dont know here hypochondria what .id cognitive therspy. I think these r not sbsilable in my country."
        }, 
        {
            "reply_author": "mary19068", 
            "reply_time": "2019-03-29T21:22+00:00", 
            "reply_content": "Hi Fearheartproblems Cognitive Therapy helps you to calm your   down and stop you being overly stressful about your health problems, especially when all your tests are good and you are still getting stressed and thinking you have a heart problem. See your doctor and discuss Cognitive Therapy with him or her. Show him/her this forum and replies...."
        }, 
        {
            "reply_author": "Sway", 
            "reply_time": "2019-03-29T21:54+00:00", 
            "reply_content": "I hate to be negative but he will not. people have already suggested this. He continues to say he doesn't understand but when I write in his Native language he doesn't respond back."
        }, 
        {
            "reply_author": "Fearheartproble", 
            "reply_time": "2019-03-30T07:27+00:00", 
            "reply_content": "Thanks mary. I will discuss about the cognitive thetapy with my dr. Thanks u all people who understand and help me."
        }, 
        {
            "reply_author": "mary19068", 
            "reply_time": "2019-03-29T12:44+00:00", 
            "reply_content": "Hi Fearheartproblems Ah right no exercise. Your results are showing your arteries are NOT obstructed so that's ok..."
        }, 
        {
            "reply_author": "Fearheartproble", 
            "reply_time": "2019-03-29T20:44+00:00", 
            "reply_content": "I think arteries  r not obstructive this is good sign. But these r slso not normsl in report. There is some tjing wrong in it thst i cannot understand and i m afraid."
        }, 
        {
            "reply_author": "mary19068", 
            "reply_time": "2019-03-29T21:41+00:00", 
            "reply_content": "Hi Fearheartproblem If you fear there is a problem with your heart then the best person to speak to about it is your doctor. He or she can explain things to you better than we can on the forum. We are not doctors. We just try and help IF WE CAN."
        }, 
        {
            "reply_author": "Fearheartproble", 
            "reply_time": "2019-03-30T07:36+00:00", 
            "reply_content": "Mary here is a problem . dr just listen me  5 mint. In this time i can only explain them history and they see my medical history.  And they littlely listen my current disease. I try change many time dr but again that story. I thing dr dont understand me but some ppl  say dr right and experienced. I think i hv heart problem but i dont believe.because i dont walk and lift weight."
        }
    ], 
    "post": "From almost 3 year if i walk quick or lift any weight and then rest. My heart sinking and feels its muscels taking much time to become its normal rest mode or place. I feel light heavyness in heart and uper abdomn. I discuss with many cardiologist about this issue. Almost many blood test dr took. 24 hour holter test. \n are normal. Thyroid tests r also normal. But i cannot do jogging or run quick. If i do this its my heart is going to fail. Or it arrest. What do u think am i hv CFS. My heart did not bear any load. Doctors give me most sleeping or resting pills. Please guide me.\nThe second issue is this please tell me what is difference between normal or unobstructive.\nHello all. ,5 year ago cardiologist did my ct angio. That was normal.\nStudy....coronaries\nCalium score...zero\nLMS.....NORMAL\nLAD .....normal\nLCX.....normal\nRCA......dominant. Normal\nAdvise....Reasurance\nin advise dr written reasurance. After that i have heart problem that my heart is so weak. So many visited to cardiologist. They check by stethoscope and with ecg and blood tests that heart is normal. But now i was visiting daily to cardiologist from one month in hospital emergency. Cardiologist decide to take my CT angio again now . and it report is this\nStudy....coronaries\nCalium score...zero\nLMS.....NORMAL\nLAD .....UNOBSTRUCTIVE\nLCX.......Dominate. Unobstructive\nRCA......UNOBSTRUCTIVE\nConclusion...unobstructive coronaries arteries.\nNow i m very much disturb that 5 year ago and now reports are different. 5 year ago all result of ct angio were normal but now results are UNOBSTRUCTIVE.\nI dont understand medical term.\nCan anybody explain am i in danger or my arteries are normal.\nAs well i go to psychatric he decide or diogonose i have cardiac nausea. He gave me citalopram. Do you think i have actually cardiac issue or its totally mental issue. And my mind is playing with me.\nThank you very much.", 
    "author": "Fearheartproble", 
    "title": "Am I have Cardic Nausea"
}
{
    "reply": [
        {
            "reply_author": "patient_mod2", 
            "reply_time": "2018-12-27T11:41+00:00", 
            "reply_content": "Hi PeterNopp We note from a recent post which you have made to our forum that you may be experiencing thoughts around self-harm. If we have misinterpreted your comments then we apologies for contacting you directly. But if you are having such thoughts then please note that you are not alone in this, and there are people out there that can help. If you are having these suicidal thoughts then we strongly recommend you speak to someone who may be able to help. The Samaritans offer a safe space where you can talk openly about what you are going through. They can help you explore your options, understand your problems better, or just be there to listen. Their contact details are on our patient information leaflet here:  , which also offers lots of other advice on how you can access the help you may need. If you are having such thoughts then please do reach out to the team at the Samaritans (or the other people detailed in our leaflet) who will understand what you're going through and will be able to help. Kindest regards Patient"
        }, 
        {
            "reply_author": "Vish2015", 
            "reply_time": "2018-12-27T12:35+00:00", 
            "reply_content": "What about the tests ?  Did you go through endoscopy, breath test to find any type of bacterial infection? Did you try antibacterial gargling or mouth wash?"
        }, 
        {
            "reply_author": "lester90053", 
            "reply_time": "2018-12-27T14:05+00:00", 
            "reply_content": "The foods you are eating may be interacting with another disorder. Get some radiological scans and consult a nutritionist for a proper diet."
        }, 
        {
            "reply_author": "mary19068", 
            "reply_time": "2018-12-27T22:43+00:00", 
            "reply_content": "Hi PeterNopp You may be suffering with post nasal drip when mucus from your sinus goes down your throat instead of through your nasal passages. It can make your breath smell really bad. You will have to be referred to a specialist who  deals with the Sinus. If your in UK it's Ear, Nose and throat Specialist. You may have sinus polyps that causes your post nasal drip. Ask your doctor to refer you to an ENT Specialist because you may have a sinus infection as well as  ...."
        }, 
        {
            "reply_author": "PeterNopp", 
            "reply_time": "2018-12-28T20:54+00:00", 
            "reply_content": "i spend more than 3K $ on this problem but it's getting worse every single day First i went to a nose/ear specialist and he told me to do a  .. i did the MRI scan for sinus and they found nothing , everything was clear. there is no infection of anything. she just gave me   : prednisolone and a mought wach i used them , at first the bad breath was gone for the time i was taking the meds when i finished the treatment after 2 days i noticed the mucus dripping back with the smell , and aggravated back when days goes, after 1 weak i was at step 0 , got back to here and she gave me a much stronger antibiotic the Moxifloxacin it was a very hard pill that caused me tiredness  , pain and fatigue after i finished it the same thing happened back the mucus was dripping back and the smell was there! then i tough it was coming from my stomach because i have hard time breathing and upper stomach pain when my stomach is empty ( i have to eat every 2 hours) keep it full so i can breath well and have no pain \" i think it's because the amount of phlegm that was filling it , and it was upset ! it's the worst thing that can happen to anyone .. i got to a stomach specialist doctor and did a fibrescope inspection 2 times with 2 different doctors both of them took some of my stomach tissues and analysis  after they didn't found anything abnormal with the camera scope , the result says that there is nothing in my stomach it was clean ! she gave me parasites scan &  IFOBT scan (looking for blood in the cells) but everything was negative nothing shows up HEPATIT C / B analysis as well where negative Blood test : Red blood cells and white blood cells where normal only one single clue is thae ALAT & ASAT where a bit higher than the normal SGOT/ASAT is 48 the normal (10-40) SGOT/ALAT 59 the normal is (10/40) at first she tough it was due to acid reflux i was taking days and days of Esomeprazole and Anti-reflux pills , all sorts of all kind , they where not working. and after all these analysis & scans the doctor gave me a 15 day treatment for   because she tough also it may be the cause , i took the antibiotic she gave me it was a very hard treatment with absolutely 0 result , even that the test says that i don't have any presence of pylori she gave it to me! the same thing happened after i finished the medicament , the bad smell and mucus were  back ! she gave up on me and told me to go to an Nose and throat doctor. this time the doctor gave me the same prednisolone that i already tried with some nose cleaning stuff i used them as he told me and came back to him after 20 days with no result he inspected my nose with a fiberscope camera and told me that nothing was showing up ! and he suggested me to go to a pulmonologist i did go to a hospital this time did the lung scan they where fine ! the doctors here have no idea what's causing my problem Stinking BREATH a lot of PHLEGM that cause me trouble breathing and stomach pain ! i wake up in my room like a rotten animal you can smell the odor 5 meter away . I GAVE UP The saliva or mucus is constantly dropping from throat all the day clearing and spiting all day , the think is this mucus is stinking and smells like an animal have died inside me , that's so hard to fight ! i can't talk to people i don't get out from my room for months. it's a very hard thing to deal with the local doctors we have her are inexperienced and can't find out what's the source of my problem. if someone could help i can send him all the scans and analysis i did for the last 3 years i just wanna be cured or die in peace...."
        }, 
        {
            "reply_author": "PeterNopp", 
            "reply_time": "2018-12-28T21:05+00:00", 
            "reply_content": "the only thing i found useful is Bitter orange i take half a cup of it's juice during the night it seems to help a little bit with the odor other than that i have to eat and don't leave my stomach empty for more than 2 hours or less because when my stomach is empty it's very upset because of the amount of phlegm that's dripping to it.  i start having trouble breathing and i feel a lot of pain in my stomach/chest i can't find out where is the problem is coming from i tried everything pills , mouth washes , nose sprays , antibiotics nothing seems to work. it's so hard to stay at your room for months without  going outside because you smell like a rotten animal."
        }, 
        {
            "reply_author": "PeterNopp", 
            "reply_time": "2019-03-27T16:17+00:00", 
            "reply_content": "Update march 27 , 2019 i was diagnosed with H pylori i finally know the source of my problems i'm at day 10 on triple therapy treatments"
        }, 
        {
            "reply_author": "vanessa03649", 
            "reply_time": "2019-03-30T05:40+00:00", 
            "reply_content": "so glad to hear you found some hope! how are the treatments going for you? are they helping?"
        }
    ], 
    "post": "I've been suffering from this disease for  5 years\ni'm still young , i'l be 26 years in next April\nMy problem started in 2014 with a sudden  'bad breath'\ni noticed that my breath smells so bad in the evening for a while\nafter some months it's aggravated to a very stinking smell that comes out of my mouth\nI've seen a lot of doctors and used a lot of \n and nothing seems to work\nSo i gave up !\nyears later i noticed that the smell comes from a tick mucus that drops a lot when i'm sleeping\nand this mucus have a very stinking smell that you can't even enter the room i'm sleeping in in the evening .\nit's always dripping from my throat and i am constantly trying to clear it out\nnow it's more and more difficult to live  with that problem\nthe mucus drops all the day to my stomach and it's very upset and starts swelling a lot\nthe thing is, i can't figure out where is this coming from local doctors have no idea about my case\nwhen i wake up i absolutely need to eat a lot\notherwise i feel like a hole in my stomach i can't even breath\ni'm having trouble breathing as i feel like someone is squeezing my upper stomach & chest\nwhen i eat i feel relieved .\nand i think it's from the quantity of mucus that enters to my stomach at night\ni really can't find out where is the problem is coming from\nI've seen a lot of doctors and no one have any lead!\ni'm slowly dying from that smell & i can't suffer no more\ni really started to think about suicide\ni need help\nplease any lead where i should start to look for", 
    "author": "PeterNopp", 
    "title": "Slowly dying from stinking mucus ."
}
{
    "reply": [
        {
            "reply_author": "Jluis", 
            "reply_time": "2019-03-27T17:42+00:00", 
            "reply_content": "Hi Krista , I Got the same sympthoms , it started when excercising , I felt a terrible burning sensation on my back , most of the time on the center , also ob my arms ., It is very frustrating , I see a gastroenterologist but still have the same issue , now is less but still going . He put me on Fodmap diet , check the web and follow the diet ., the thing it is very hard to follow a diet . Then first he said take gas x , apple cider vinegar .,  I tried both didnt work much . OMEPRAZOLE , didnt work , CALCITRATE didnt work . Now I start with ACV , to see if this work this time . I did all the tests necessary and all clear ., I wonder if this test afected more such as endoscopy or   . I have a new app with the doctor tomorrow . All this started after taking blood pressure medicine., before never a problem . keep you posted"
        }, 
        {
            "reply_author": "Krista35738", 
            "reply_time": "2019-03-27T21:27+00:00", 
            "reply_content": "I'm so sorry Jluis. Omeprazole worked for me. I hope it will work again. I hope you find an immediate cure."
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-27T19:43+00:00", 
            "reply_content": "The burning and pain in your back sounds like you may have strained it during your workouts.  A burning sensation can be a symptom of an irritated nerve.    The exertion of the press ups could have released trapped wind.  Ease off the workouts for a few weeks to see if it makes a difference."
        }, 
        {
            "reply_author": "Krista35738", 
            "reply_time": "2019-03-28T00:54+00:00", 
            "reply_content": "Thanks. I'll never exercise again."
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-28T01:11+00:00", 
            "reply_content": "Very light exercise such as walking would still be fine if you want to do some physical training.  Simply avoid the vigorous workouts you have been doing.  You don't have to give up all exercise;   Gentle walking will do you no harm.  No exercise at all would not be good for you.  Moderation is the key.  You could always go back to press ups gradually once your symptoms subside.  Just don't do too much."
        }, 
        {
            "reply_author": "Krista35738", 
            "reply_time": "2019-03-28T01:55+00:00", 
            "reply_content": "I walk a lot. I'll refrain from abdominal exercises cause my belching stems from it. I won't ever do them again because after 2 sit-ups, I felt gas bubbled up my neck, in some artery.  The first time around before I consumed any medication, both sides of my neck would hurt. I would feel the gas moving up my neck in a rush. It was a pulsated feeling. I also suffered pain in my forearms. At one point, my chest hurt. I realized these are heart attack signs. I couldn't believe it was happening and it was then I rushed to the hospital. Two weeks worth of 20mg Omeprazole got rid of all belching and aches. However, I was never specifically diagnosed. When I began exercising again, it returned. Therefore, I won't participate in abdominal nor strenous exercises."
        }, 
        {
            "reply_author": "christelle51966", 
            "reply_time": "2019-03-28T16:02+00:00", 
            "reply_content": "Hi Krista, my symptoms all started when I decided to exercise as well. I noticed that I would burp a lot and have stomach discomfort. Fast forward,I was diagnosed with GERD and small hiatal   via endoscopy.( that might not be the case for you). I manage my symptoms with 20mg  ezomeprazole  but every time I try to do some abdominal exercises ,the belching returns for another week or so. So abs  exercises are a no for me. I find that my body tolerates brisk walking only. Get better soon!"
        }, 
        {
            "reply_author": "Krista35738", 
            "reply_time": "2019-03-28T16:52+00:00", 
            "reply_content": "Our case is pretty similar. No tests were carried, nothing. The doctor just brushed off all the signs and symptoms that I told her I was experiencing.I've decided to stop all abdominal workouts and stick to walking briskly and controlling what I eat. Hopefully, I will be fine in due time. Wishing you a speedy recovery Christelle."
        }, 
        {
            "reply_author": "Krista35738", 
            "reply_time": "2019-03-28T17:01+00:00", 
            "reply_content": "Does some part of your back burn? By the second time around, my back started burning. It's a new symptom. Whenever I sit upright or stand upright, it burns."
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-28T17:12+00:00", 
            "reply_content": "Maybe there is no specific diagnosis for what you are experiencing because it is down to a reaction your body has to strenuous exercise.  It may be something to do with your metabolism and it only affects people with that particular metabolism."
        }, 
        {
            "reply_author": "christelle51966", 
            "reply_time": "2019-03-29T05:22+00:00", 
            "reply_content": "My back doesn't burn after or during workouts. I have dull but almost constant pain on the upper left side of my stomach that radiates to the back.  I am sure mine is due to the hiatal   /GERD.  I m planning on seeing another doctor just to seek a second opinion. My worry is the constant pain. I have read so much about my condition and nobody has this pain on a daily. Get better soon Krista!"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-29T10:26+00:00", 
            "reply_content": "Everyone is different with hiatus hernias/GERD and some may experience more pain than others.  Worry makes the pain worse.  Try light exercise such as walking and do things you enjoy to take your mind off the pain."
        }
    ], 
    "post": "I believe it all started when I began exercising. I noticed that I was burping excessively. That went on for about a month so I visited my doctor. She diagnosed me with dyspepsia/ indigestion/ acid reflux. She prescribed Dica and Raniticidin. That didn't work. I went to another doctor, she prescribed Omeprazole. It worked like a charm. Unfortunately, the burping returned months later when I decided to do some situps. I felt gas bubbled up my neck instantly. The belching was worse and it came along with a burning sensation on the left lower part of my back. Sometimes I feel the middle of my back , on my spine , has mild pain. It burns whenever I sit upright but when I lie down, the burning subsides. I got Omeprazole again, and I hope it works. At the end of 2 weeks, I will give an update. If it doesn't work I'll have to see a gastroenterologist.\nHAS ANYONE FELT THIS WAY? WHAT  WORKED FOR YOU?", 
    "author": "Krista35738", 
    "title": "Excessive Burping with Burning Sensation in Back"
}
{
    "reply": [
        {
            "reply_author": "m23228", 
            "reply_time": "2015-01-04T10:05+00:00", 
            "reply_content": ""
        }, 
        {
            "reply_author": "lorraine21458", 
            "reply_time": "2015-06-02T14:53+00:00", 
            "reply_content": ""
        }, 
        {
            "reply_author": "sue97573", 
            "reply_time": "2016-07-25T16:18+00:00", 
            "reply_content": "My gallbladder was removed via laparoscopy in 1998.  Eighteen years later I'm still in periodic pain.  My right side routinely swells and causes me considerable discomfort, as I'm sure you well know.  I've seen several doctors and had abdominal scans, etc., but no one has been able to solve my problem. One explained that a \"stalk\" of the gall bladder was left behind (the fault of a hurried surgeon, no doubt--I was lined up with other pre-surgical patients like we were on a conveyer belt $$$$$).  That gall bladder stalk still fills with bile, as when the whole organ was there, hence the chronic pain, which I have learned has a name: Post-cholecystectomy Syndrome. I ordered a Biotherapy powder called Genuine Karlovy Vary (Carlsbad) Thermal Spring Salt. You dissolve 1 tsp in warm water and drink 1-1/2 cup of before a meal, which is purported to help this problem.  I tried it only once so far, and it seemed to help some.  You have to be careful what you eat.  I find I can no longer digest fats, nuts or nut butters, and there are special diets if you have no gall bladder that may help. As with the routine removal of children's tonsils in the '50s, I think some doctors are too quick to turn to surgery when other options might first be tried, but those don't usually make the big bucks.  Even the littlest organs in our bodies, like tonsils and gall bladders, perform important functions.  IMO, doctors who dismiss a desperate patient's search for answers to their problems on the Internet when doctors have none to offer should be stripped of their right to practice medicine or at least sent to a sensitivity training course. "
        }, 
        {
            "reply_author": "juliana33948", 
            "reply_time": "2018-03-20T05:52+00:00", 
            "reply_content": " Id get a different doc. If you paid a plumber to fix a leak and he did a half baked job.... leaving you to buy tools parts and putty to fix a pipe he didn't completely fix....do you think he would have the nerve to take your money and ridicule you for trying to finish the job he didn't know how to do correctly? "
        }, 
        {
            "reply_author": "myra1969", 
            "reply_time": "2019-03-28T02:29+00:00", 
            "reply_content": "Hi Lorraine, life is interesting...sorry for the inconsistencies of the medical field and your pain and frustration with it that we all face, right. It is true, WE do need to do our homework as we know our bodies best, not them. And remember they are Practicing Physicians. Yes, and they are practicing on us, so your knowledge and voice is important."
        }, 
        {
            "reply_author": "bethemt", 
            "reply_time": "2016-12-01T20:41+00:00", 
            "reply_content": "This is exactly what I have been going through! 2 years ago I had a hidascan done as well, \"normal\".   I am an EMT and know this pain is not normal, and it came quite acutely, but has lingiered. My RUQ is very swollen and tender.  It hurts, some days it feel like it is going to explode, some if feels as if something is moving just under my skin in that area. It is very aggravating!     new doc just got labs back and said all is normal, except cholesterol is slightly elevated. I would LOVE answers.  : ("
        }, 
        {
            "reply_author": "della20500", 
            "reply_time": "2018-02-09T17:44+00:00", 
            "reply_content": "I am going thru the same thing with the swelling and I was thinking it was my liver but I had ultrasound done and the liver and gall bladder are fine. However they did fine multiple renal stones in my  ureter with mild hydronephrosis... I'm curious did u ever find out the cause of all this"
        }, 
        {
            "reply_author": "misty67151", 
            "reply_time": "2016-12-05T18:10+00:00", 
            "reply_content": "I have much of the same going on. I have URC pain, swelling that moves from my lower to middle then upper abdomen. I get shooting pains under my ribs and sometimes the \"squeezing\" feeling from the bloating that I vomit. It is totally awful. I've had 4 CAT scans, ultrasounds, Hida scan with contrast, blood work out the wazoo. I also had a  , endoscopy and had the bacterial levels checked. NOTHING! The swelling sometimes is so bad that people can actually see it getting bigger and the pain wakes me nearly every night. I'm looking for anyone that has had the same thing and found this forum. I don't see that anyone had a physcian or any other indication of what this could be?  "
        }, 
        {
            "reply_author": "LittleBit62", 
            "reply_time": "2017-03-08T13:53+00:00", 
            "reply_content": "Wow! Finally someone who is experiencing the same exact symptoms.  I have all the things you've been diagnosed with  too. The bloating & pain in my ribs can be so uncomfortable. Doc told me just poop more. Lol. I switch from diarrhea to   all the time. I gain about 30 pounds in 2 months. And thought,  ok so is this what fat feels like? I have hashimotos & RA, OA .lots of Gass and autoimmune & just found out I've had 2 strokes that Doc NEVER TOLD ME ABOUT.  Now a blood clot in right groin. I'm really sick of all this.  But glad I'm not alone  Anybody finds out what this is PLZ POST! .  "
        }, 
        {
            "reply_author": "shannon05827", 
            "reply_time": "2017-03-12T05:47+00:00", 
            "reply_content": "Have you had any other symptoms Misty67151? Or found out anything new?  I am having some strange systems, I went to the Dr the first time BC my ears were ringing, I was spiking fevers often, I was extremely fatigued, felt dizzy, headaches and overall just feeling bad. I have Lupus,  ,   so I have bad days but this has turned into bad 3 months. Also I've been taking fluid meds for years, I swell normally in my fingers, legs feet and if it gets bad my stomach and all over but I told the I have swollen up bad especially in my upper abdomen. I also told her I've gained 45lbs in less than 3 months mostly in stomach which is very odd for me bc I'm usually a size 4 and can't gain weight even when I try. I just turned 40 but this isn't just middle aged spread especially since I've cut my calories to 1200 daily I eat hardly any sodium plenty of fiber. Anyway, BP is perfect,they tested mythyroid is goodand other blood work came back good they gave me a round of   and Prednisone bc if they don't know what it is it must be a Lupus flare but I've had Lupus 10 years this is not normal. I got the fluid down and everywhere and now I see it's not my usual fluid that my upper abdomen is swollen and it hurts if I press on it. My stomach muscles have been sore in a weird way not from exercising  deeper but feels like muscle aches. It swells worse at night every night. I don't have any stomach problems, no indigestion, gas or anything but I do feel uncomfortable after I eat like it swells more my head hurts and just feel funny and I don't overeat ex: 1 small wrap with her chicken Lett, tomato if I finish that. Im miserable, none of my tops fit my stomach just feels like a hard ball. I just moved from Alabama to TN so I'm having to find new Dr. I had same Dr for over 10 years he would have tested til he found out WTH is wrong. I've been to 2 Urgent Care Drs and now have a New Primary Care but she didn't do much and I still feel horrible. I have enough health issues that cause alot of pain to deal with new ones. Does anyone have any other symptoms like   headaches dizzy? I did try an ACAI Berry Cleanse for 5 days I got at Walmart it helped alot temp. The swelling went down for a couple days and some discomfort. It's all natural and actually good for you to do occasionally. If anyone has any advice or finds out any new news please let us know. Thanks! "
        }, 
        {
            "reply_author": "wlangw", 
            "reply_time": "2017-09-24T22:38+00:00", 
            "reply_content": "I've had this pain for over 40 years. Seen many GI specialists and many more test over the years than any have mentioned on site. I have had my gallbladder removed about 20 years ago, I have   and IBS. My condition has only gotten worse over the years despite any treatment tried. My abdomen swells all the time and pain is severe most of the time. I like all others with this problem deserve an answer and hopefully some solution that can at least help us to the point were not in agony. I've searched high and low for answers and haven't seen any. It appears the medical community is stumped by our problems. I wish they had some clinical trials that address our particular problem. I can't blame Doctors if their is no research or investment in this particular area of suffering by what appears to be many individuals. I'm righting not just because I've suffered for so long with no answers but because I appear to be the only male writing about this issue. I hope other males who face these symptoms will come forward also. Maybe if enough of us complain some medical clinic will take on our plight and look for real answers. Its obvious its not in our heads and we deserve the same attention as any other debilitating medical problems people are finding answers to. I wish you and every suffering from any medical problems find relief and have people in your lives that understand and help you whenever possible. Many blessings to you and everyone always from my soul to all of yours."
        }, 
        {
            "reply_author": "darrius48093", 
            "reply_time": "2017-11-02T04:13+00:00", 
            "reply_content": "Hello, I recently started to have pain, and I was thinking It was due to my acid reflux. I started to take some natural remedies for those problems, but the pain would come off and on. Then I though i had a bacteria infection (h-pylori), so my doctor recommended a ultrasound .  Test results came back, indicating that I have a spot on liver they're assuming it's homangeno and rule out   of the liver. But in so much in pain and feeling terrible. And in a male, I need help."
        }, 
        {
            "reply_author": "al14944", 
            "reply_time": "2017-12-06T00:41+00:00", 
            "reply_content": "I have the exact same issue as you I believe. Last 2 doctors I've seen think I have mental issues now too.  Just seen a internal medicine specialist tested me for everything said my blood work all came back normal. Been over a year for me now and I'm back at stage 1"
        }, 
        {
            "reply_author": "sher70", 
            "reply_time": "2018-02-13T05:06+00:00", 
            "reply_content": "Did the ringing in the ears go away? I do not have problems with fevers, but the ringing in my ears I always dismissed as damage from loud noises.  Turns out it was from a benign brain tumor, an  .  I also have a slew of things wrong with me and came here due to recent   and pain up high but on the right side of my ribs. Initially this began as what seemed like a hiatal    but has me wondering with the weight gain, pregnant looking abdomen etc if it's not something else. I too am about the same age, 39, and was always small and am now squeezing into my jeans and looking for big shirts.  Came on suddenly, does not seem age related. I do however  have an under-active thyroid,(a lot of Dr.s do not do the complete testing they need to do to be certain a thyroid problem does not exist) but it has never caused any weight issue and definitely not a pregnant abdomen. I have been busy with changing insurances, children's needs and the tumor, but I will begin trying to figure this new issue(s) out. "
        }, 
        {
            "reply_author": "bec63606", 
            "reply_time": "2018-04-21T01:54+00:00", 
            "reply_content": "My best friend shes 59. She has almost same symptoms as you. Shes had this for over a year now. Where under her right breast is hard and swollen. Its like you watch it swelling after she has finished eating. Causes her a great deal of pain. She has had about CT scans done. Then had another   that was more advance. Her blood test always come back really good. 3 days ago the pain was so bad she ended up in hospital. Of course they checked her over and more blood test done that came back good once again so they let her come home. I live with her i see this everyday how uncomfortable she is. Its really sad. The last test to have done CV is a camera done her throat to see whats going on. When you touch her tummy under her bra line you can feel its hard its almost like something is growing over the last 12 months it is getting worse. She feels better when laying down. Hurts more when walking around. Would love to hear more stories.                     "
        }
    ], 
    "post": "I have upper abdominal swelling that occurs every few days thats tender and sore, pain significant on right side under rib cage.\nThis all started with a pain under my upper right rib cage.  I had an ultrasound done that showed enlarged liver. CT of theabdoment showed  showed one large hemangioma and 2 smallers ones on liver.  kidney, pancreas, esophogas showed unremarkable.  After I had CT done it appeared that my abdomen swelled up - the swelling went from lower abdomen to upper abdomen.  Had gallbladder hida scan done came back negative - number was 40, still was experiencing pain.  Surgeon indicated he doubt that the pain was from hemangioma.  Blood work came back fine.  Still having pain every other day under right rib cage, and swelling only in upper abdomen area.  GI indicated scope was not necessary.  Only other thing is I'm going through menopause.  Anyone experiencing this - please help.  this has been going on for 2  months.  Surgeon indicated hida scan was done by me drinking ensure, need to repeat with nuclear med.  Let me know if you are experiencing any of  this.  Thank in Advance. ", 
    "author": "cris_85077", 
    "title": "Upper abdominal swelling, right upper quadrant pain"
}
{
    "reply": [
        {
            "reply_author": "mary19068", 
            "reply_time": "2019-03-24T20:06+00:00", 
            "reply_content": "Hi Bsaman001 You do not mention having any blood tests.  You should have a full blood count. Low iron, Low vit b12 and vit d can cause digestive and gut problems also tiredness and fatigue. Ask your doc to order the blood tests as a second opinion..."
        }, 
        {
            "reply_author": "Ron351", 
            "reply_time": "2019-03-24T20:35+00:00", 
            "reply_content": "I'm so terrible sorry for what you are going through. I've suffered some abdominal problems and I want to offer just a bit of information that may help. My colon was adhered to my bladder and that caused some similar problems in me.  I'm afraid surgery was required to fix my problem. Is it possible you have parasites suddenly living in your colon? There is a therapy discussed on youtube by a Doctor Jay Davidson that may interest you. It worked for me and I was actually able to see the little buggers in the bowl. Oh it's called the Gerson Therapy.  I hope you find an answer soon. Ron351"
        }, 
        {
            "reply_author": "Bsaman001", 
            "reply_time": "2019-03-24T21:01+00:00", 
            "reply_content": "Yes i have had 4 general   to check for any abnormalities which all came back clear. I did think about a possible worm or parasite problem, the doctor told me any parasite or worm would show up instantly in a stool sample and having 10+ clear he doubts it. I did secretly take a course of worm medication which failed to help, having a rural lifestyle i hoped that would be a possibility."
        }, 
        {
            "reply_author": "lester90053", 
            "reply_time": "2019-03-25T12:58+00:00", 
            "reply_content": "Suggest you consult a registered dietition or nutritionist who can give you a daily menu of food to consume for your condition. Many will accept insurance if referred by your doctor."
        }, 
        {
            "reply_author": "Corvette007", 
            "reply_time": "2019-03-25T17:44+00:00", 
            "reply_content": "Dear Bsaman001, I have similar problems but it NEVER means we have the same issue. I also feel very sorry for you and hope you hang in there. Do NOT give up. The first recommendation if your are going to try to help the G.I. Dr's find this issue is to watch how much comes out. If you are NOT going to the bathroom much and the amount going out is less than what is going in. The food is NOT going into stomach for whatever reasons or staying in stomach and is a Gastro issue. If you are just having bad stool and suffering. It sounds like a post gastro colon/prostate or maybe even Pancrease. The biggest problem you and the Doctors could be experiencing is a problem that is slowly about to show its ugly face when it completely fails. I got lucky on my diagnosis that they found the problem on the first endoscope. Because the second time they did endoscope. The problem was not present and I got rejected for 2 years and fought for my life. Then when it was obvious I was going to die, they admitted it was an intermittent issue and it had finally failed and they no longer debated my diagnosis. Never give up. Keep asking questions, keep begging, keep checking into E.R. too when it is at it's worse. Eventually it will be so present the right Doctor will make your day. Diagnosis is the first step towards recovery. As far as   attacks. They are my worse enemy. And the treatment is to blame it on psychology and ignore your issues. Do your best to hide and conceal it. Make them focus on the real issue causing it. It is NOT always a psychological issue. I wish I was  a Dr...There is another guy in this form Pippa. He seems to be the best help. Food Diary on what goes down and what comes up is a very good start. I did same thing and even charted my daily weight losses on a chart. It was useless after I found out what my disease was. But it did help me narrow it down. I still have certain foods and drinks I can eat and some I can NEVER touch again. How much weight have you lost so far? Do NOT let it get below 120lbs. or you will be in surgery danger zone. At 90 lbs and less no Dr. can help you. Onlya feeding tube will keep you alive. When you are ready go for it."
        }, 
        {
            "reply_author": "Corvette007", 
            "reply_time": "2019-03-25T17:49+00:00", 
            "reply_content": "My apologise. Went back and read your statement of losing 2.5 stones which is 35 lbs. in the U.S....I think you might be getting close to qualifying for a feeding tube. Must lose 1/3 of your weight in U.S. to qualify. There are 2 types. 1 a tube down the nose. Second a G-Tube hole and tube placed in stomach. I hated it..BUt it saved my life. Whenever you feel like you cannot handle it anymore beg for feeding tube."
        }, 
        {
            "reply_author": "Corvette007", 
            "reply_time": "2019-03-25T17:51+00:00", 
            "reply_content": "The lack of energy,diarrhea, and anxiety attacks are being caused by lack of food intake. Glad it goes away now and then..BUt when it is at it's worse..That is when to let them try again."
        }, 
        {
            "reply_author": "waffenamp", 
            "reply_time": "2019-03-25T17:52+00:00", 
            "reply_content": "You must quit throwing up/vomiting..... Every time you vomit you train your stomach to expel instead of digest. You must retrain your stomach to digest by never vomiting again"
        }, 
        {
            "reply_author": "Corvette007", 
            "reply_time": "2019-03-25T17:58+00:00", 
            "reply_content": "Some of us have   which is when the LES sphincter completely closes to the width of a noodle and starve to death. Starvation is not as bad as  . I can go 3 weeks without any food. But 6 days is my record for no water. This guy is NOT throwing up by choice. I also read an article a month ago where a father had his daughter unable to eat due to a gullet disease. I wish it was as easy as mind over matter. But when you cannot get food into your stomach there are lots of diseases or issues that cause that."
        }, 
        {
            "reply_author": "ted43022", 
            "reply_time": "2019-03-27T01:21+00:00", 
            "reply_content": "I had that problem for about 1 year ,sick on my stomach throwing up and my navel hurting. decided to see a dr and had an ultrasound done but it said that all was ok even my gallbladder was ok but about 4 later I seen another doctor and he said that I had a navel   and that I need it fixed as soon as possible so I scheduled it but the morning of the surgery the nerve ask me if I was feeling ok or had and problems and I told her only sick on my stomach and throwing up so she called the doctor to tell him and he wanted to talk to me and told me that he was canceling my surgery because he thought that my gallbladder was bad and I told him no it can't be because I just had it tested and he ask me how and I said by ultrasound and he said that the ultrasound is not real reliable so sent me to get a test where I had to drink this drink and they took pictures and the doctor called me that day and told me that my gallbladder was bad and that was what was causing me all of my problems and that the throwing up is what caused my hernia so he took my gallbladder out and fixed my hernia at the same time. Hope this helps"
        }, 
        {
            "reply_author": "Corvette007", 
            "reply_time": "2019-03-27T23:55+00:00", 
            "reply_content": "It was called an esophagram Ted. Good Job!! I forgot how important those are for this type of issue. You drink a barium shake like drink then get in front of an x-ray that records the barium going down through your digestive system. That is an excellent item for him to do if the Dr's have not allready done it. Other than that. Those are all the tools they have to treat digestive issues."
        }
    ], 
    "post": "Hello everyone, i am looking for some thoughts and advice about a health issue i have been battling for 8 months now.\nI am a 24yr old male and it all started back in july/august.\nOver 2 weeks i had 4 random episodes consisting of sudden overwhelming sickness usually followed by vomiting or gagging and sometimes a severe bowel movement or activity.\nThen one day in august shortly after getting up and eating normally it hit hard. had the same vomiting and severe nausia, but refused to stop all day and could not eat.\nThe next day followed the same, vomiting and gagging shortly after waking up with added severe diarrhea, no apatite, shaking, feverish, weakness, \n and \n. This occurred every day for 2 weeks. I was absolutely dead, would spend most days sat and wandering about my land necking bottles of water.\nEventually the diarrhea (replaced with sticky fowl smelling pale stools) and gagging/vomiting stopped. But the rest continued with general nausia and almost daily panic/anxiety attacks continued up and down in severity for 3 months causing me to loose about 2.5 stone over that time.\nDuring this time i saw 4 diffrent GPs once a week, was forced onto liquid meals for a while to counter the loss of apatite and weight loss the best i could. Went gluten and dairy free. Took over 10 stool samples which all came back clear except fecal calprotectin that came back 68 (told 0-50 was normal) 4 \n which were normal and ruled out celiac. Underwent a upper endoscopy and \n which came back clear including biopsies.\nThe symptoms toms slowly got less severe and 2 months ago managed to actually gain some weight back and had periods of feeling normal. But to this day i still suffer from abdominal pain and tenderness/soreness around my belly button especially after eating, tiredness, mild loss of apatite and nausia, bloating and gas and generalised anxiety and even over the smallest daily tasks especially eating.\nI feel that my doctors are out of ideas and classed it as ibs but with non of the following medicines greatly helping\nColestid, mebevaline, Amitriptyline 10mg, buscopan, probiotics, slippery elm extract, lansoprazole, imodium.\nI am a ruined man. It has destroyed my life and am on my knees begging for help.", 
    "author": "Bsaman001", 
    "title": "Long suffering mystery illness, out of ideas and hope. "
}
{
    "reply": [
        {
            "reply_author": "fernando90225", 
            "reply_time": "2019-03-26T17:22+00:00", 
            "reply_content": "you could need to eat more fiber too loosen impacted feces in your bowel. a colon cleanse also for this. also you could have hemmoriods that cause flat stools too."
        }, 
        {
            "reply_author": "kyle36591", 
            "reply_time": "2019-03-26T17:23+00:00", 
            "reply_content": "flat stool?? if you mean   then it could be hundreds of things. an infection,  , IBS, IBD, the nasty C word. I honestly wouldn't worry about it unless it's pure black or has red blood in it. if it Carrie's on longer than 2 weeks then see your gp. I've had the same issue for years now and have been re-referred to gastro for an investigation"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-27T12:37+00:00", 
            "reply_content": "Conditions such as haemorrhoids, anal fissures,   and IBS can cause flat stools.  Diet can also change the shape, size and texture of stools.    Try a food diary to see if what you are eating is causing it.  However, since you have had this for months, see your doctor."
        }
    ], 
    "post": "I've had flat stool for several months; what could it be?", 
    "author": "tim61897", 
    "title": "flat stool"
}
{
    "reply": [
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-19T23:09+00:00", 
            "reply_content": "Does your pain move about?  If so, it might be IBS.    Ask for a HIDA scan and ultrasound to rule out gallbladder problems."
        }, 
        {
            "reply_author": "deborah48329", 
            "reply_time": "2019-03-20T18:17+00:00", 
            "reply_content": "sometimes it moves around. mostly stays in the upper right"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-20T19:45+00:00", 
            "reply_content": "Shifting   could be sign of IBS."
        }, 
        {
            "reply_author": "deborah48329", 
            "reply_time": "2019-03-20T22:53+00:00", 
            "reply_content": "hopefully get some answers tomorrow. Dr appointment at 1:30"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-21T01:29+00:00", 
            "reply_content": "Good luck."
        }, 
        {
            "reply_author": "deborah48329", 
            "reply_time": "2019-03-24T22:38+00:00", 
            "reply_content": "yep...ibs with  . I'm on medication for it."
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-25T01:54+00:00", 
            "reply_content": "Were you given an anti spasmodic and which one?"
        }, 
        {
            "reply_author": "deborah48329", 
            "reply_time": "2019-03-26T13:22+00:00", 
            "reply_content": "Dicyclomine.... seems to be helping some."
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-26T14:02+00:00", 
            "reply_content": "That's good news that the medication is helping.  I find taking   along with an anti spasmodic helps to get rid of the pain completely.    Often antispasmodics reduce the pain only rather than taking it away entirely."
        }, 
        {
            "reply_author": "kath29079", 
            "reply_time": "2019-03-26T14:23+00:00", 
            "reply_content": "Which painkiller please?"
        }, 
        {
            "reply_author": "deborah48329", 
            "reply_time": "2019-03-26T15:11+00:00", 
            "reply_content": "I use ibuprofen"
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-26T15:51+00:00", 
            "reply_content": "Ibuprofen."
        }, 
        {
            "reply_author": "kath29079", 
            "reply_time": "2019-03-26T17:02+00:00", 
            "reply_content": "Thank you. I read a lot about gallstones and it is contradicting Some say eat low fat diet and others say low fat diet is the cause of gallstones Any ideas?"
        }, 
        {
            "reply_author": "kath29079", 
            "reply_time": "2019-03-26T17:02+00:00", 
            "reply_content": "Thank you. What have you read causes gallstones?"
        }, 
        {
            "reply_author": "deborah48329", 
            "reply_time": "2019-03-26T17:38+00:00", 
            "reply_content": "I've heard fat can irritate them, but I'm not sure."
        }, 
        {
            "reply_author": "pippa58442", 
            "reply_time": "2019-03-27T12:27+00:00", 
            "reply_content": "Gallstones are thought to be caused by an imbalance in the chemical make-up of bile inside the gallbladder. Bile is a liquid produced by the liver to help digestion.  It's unclear what causes the chemical imbalance, but gallstones can form if there are unusually high levels of cholesterol inside the gallbladder (about 4 out of 5 gallstones are made of cholesterol). A waste product called bilirubin inside the gallbladder (about 1 in 5 gallstones is made of bilirubin) These chemical imbalances cause tiny crystals to develop in the bile.  These can gradually grow (often over many years) into solid stones that can be as small as a grain of sand or as large as a pebble.  Sometimes only 1 stone will form, but there are often several at the same time."
        }
    ], 
    "post": "I have this burning pain right about where my gallbladder is, and it seems to go away after a bm, also my stomach gurgles a lot. I've gone from being constipated last week, to urgency to go with loose stools. No tenderness there, and the pain is mild and fleeting.", 
    "author": "deborah48329", 
    "title": "Gallbladder issues?"
}
